///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПроверкаИспользования(ОбъектыРасширений = Ложь) Экспорт
	Если БазоваяПодсистемаСерверПовтИсп.СП_ОтключитьИдентификаторыОбъектовМетаданных() Тогда
		ВызватьИсключение СтрШаблон("Справочник ""%1"" не используется.", НазваниеСправочника(ОбъектыРасширений));
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	Если ПланыОбмена.ГлавныйУзел() = Неопределено И ЗначениеЗаполнено(БазоваяПодсистемаСервер.ОН_МенеджерОбъектаПоПолномуИмени("Константа.ГлавныйУзел").Получить()) Тогда
		ВызватьИсключение СтрШаблон("Справочник ""%1"" не может использоваться
			           |в информационной базе с неподтвержденной отменой главного узла.
			           |
			           |Для восстановления связи с главным узлом запустите 1С:Предприятие и
			           |нажмите кнопку Восстановить или программно установите главный узел,
			           |сохраненный в константе Главный узел.
			           |
			           |Для подтверждения отмены связи с главным узлом запустите 1С:Предприятие и
			           |нажмите кнопку Отключить или программно очистите константу Главный узел.",
			НазваниеСправочника(ОбъектыРасширений));
	КонецЕсли;
КонецПроцедуры

Функция ДанныеОбновлены(Обновить = Ложь, ОбъектыРасширений = Ложь) Экспорт
	Попытка
		Обновлен = РегистрыСведений.ПараметрыРаботыПрограммы.ПараметрРаботыПрограммы("СтандартныеПодсистемы.БазоваяФункциональность.ИдентификаторыОбъектовМетаданных");
	Исключение
		Если Обновить Тогда
			ВызватьИсключение;
		КонецЕсли;

		Возврат Ложь;
	КонецПопытки;

	Если Обновлен = Неопределено Тогда
		Если Обновить Тогда
			ОбновитьДанныеСправочника();
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;

	Если ОбъектыРасширений И ЗначениеЗаполнено(ПараметрыСеанса.ПодключенныеРасширения) Тогда
		Если Не Справочники.ИдентификаторыОбъектовРасширений.ИдентификаторыОбъектовТекущейВерсииРасширенийЗаполнены() Тогда
			Справочники.ИдентификаторыОбъектовРасширений.ОбновитьДанныеСправочника();
		КонецЕсли;
	КонецЕсли;

	Возврат Истина;
КонецФункции

Процедура ОбновитьДанныеСправочника(ЕстьИзменения = Ложь, ЕстьУдаленные = Ложь, ТолькоПроверка = Ложь) Экспорт
	ВыполнитьОбновлениеДанных(ЕстьИзменения, ЕстьУдаленные, ТолькоПроверка);
КонецПроцедуры

Процедура ЗарегистрироватьПолноеИзменениеДляПодчиненныхУзловРИБ() Экспорт
	ПроверкаИспользования();

	Если БазоваяПодсистемаСервер.ОН_ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;

	МетаданныеСправочника = Метаданные.Справочники.ИдентификаторыОбъектовМетаданных;

	УзлыРИБ	= Новый Массив;
	Для каждого ПланОбмена Из Метаданные.ПланыОбмена Цикл
		Если ПланОбмена.РаспределеннаяИнформационнаяБаза И ПланОбмена.Состав.Содержит(МетаданныеСправочника)Тогда
			ПланОбменаМенеджер	= БазоваяПодсистемаСервер.ОН_МенеджерОбъектаПоПолномуИмени(ПланОбмена.ПолноеИмя());
			Выборка				= ПланОбменаМенеджер.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Выборка.Ссылка <> ПланОбменаМенеджер.ЭтотУзел() Тогда
					УзлыРИБ.Добавить(Выборка.Ссылка);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	Если УзлыРИБ.Количество() > 0 Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(УзлыРИБ, МетаданныеСправочника);
	КонецЕсли;
КонецПроцедуры

Процедура ВыполнитьОбновлениеДанных(ЕстьИзменения, ЕстьУдаленные, ТолькоПроверка, ЕстьКритичныеИзменения = Ложь, СписокКритичныхИзменений = "", ОбъектыРасширений = Ложь) Экспорт
	ПроверкаИспользования(ОбъектыРасширений);

	УстановитьПривилегированныйРежим(Истина);

	ЕстьТекущиеИзменения = Ложь;
	Если Не ОбъектыРасширений Тогда
		ЗаменитьДублиПодчиненногоУзлаНайденныеПриЗагрузке(ТолькоПроверка, ЕстьТекущиеИзменения);
	КонецЕсли;

	ОбновитьДанные(ЕстьТекущиеИзменения, ЕстьУдаленные, ТолькоПроверка, ЕстьКритичныеИзменения, СписокКритичныхИзменений, ОбъектыРасширений);

	Если ЕстьТекущиеИзменения Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;

	Если Не ОбъектыРасширений Тогда
		РегистрыСведений.ПараметрыРаботыПрограммы.ОбновитьПараметрРаботыПрограммы("СтандартныеПодсистемы.БазоваяФункциональность.ИдентификаторыОбъектовМетаданных", Истина, Ложь, Неопределено);
	КонецЕсли;
КонецПроцедуры

Функция ИдентификаторОбъектаМетаданных(ОписаниеОбъектаМетаданных, ВызыватьИсключение) Экспорт
	ТипОписанияОбъектаМетаданных = ТипЗнч(ОписаниеОбъектаМетаданных);
	Если ТипОписанияОбъектаМетаданных = Тип("Тип") Тогда
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ОписаниеОбъектаМетаданных);

		Если ОбъектМетаданных <> Неопределено Тогда
			ПолноеИмяОбъектаМетаданных = ОбъектМетаданных.ПолноеИмя();
		ИначеЕсли Не ВызыватьИсключение Тогда
			Возврат Null;
		Иначе
			ВызватьИсключение СтрШаблон(
				"Некорректное значение параметра ОписаниеОбъектаМетаданных в функции БазоваяПодсистемаСервер.ОН_ИдентификаторОбъектаМетаданных.
				           |Указан несуществующий объект метаданных: ""%1"".",
				ОписаниеОбъектаМетаданных);
		КонецЕсли;

	ИначеЕсли ТипОписанияОбъектаМетаданных = Тип("Строка") Тогда
		ПолноеИмяОбъектаМетаданных = ОписаниеОбъектаМетаданных;
	ИначеЕсли ТипОписанияОбъектаМетаданных = Тип("ОбъектМетаданных") Тогда
		ПолноеИмяОбъектаМетаданных = ОписаниеОбъектаМетаданных.ПолноеИмя();
	ИначеЕсли Не ВызыватьИсключение Тогда
		Возврат Null;
	Иначе
		ВызватьИсключение СтрШаблон("Некорректный тип параметра ОписаниеОбъектаМетаданных в функции БазоваяПодсистемаСервер.ОН_ИдентификаторОбъектаМетаданных:
			           |""%1"".",
			ТипОписанияОбъектаМетаданных);
	КонецЕсли;

	Массив = Новый Массив;
	Массив.Добавить(ПолноеИмяОбъектаМетаданных);

	Идентификаторы	= ИдентификаторыОбъектовМетаданных(Массив, ВызыватьИсключение, Истина);
	Идентификатор	= Идентификаторы.Получить(ПолноеИмяОбъектаМетаданных);

	Если Идентификатор = Неопределено Тогда
		Возврат Null;
	КонецЕсли;

	Возврат Идентификатор;
КонецФункции

Функция ИдентификаторыОбъектовМетаданных(ОписаниеОбъектовМетаданных, ВызыватьИсключение = Истина, ОдинЭлемент = Ложь) Экспорт
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	ИдентификаторыПоПолнымИменам = КэшИдентификаторов().ИдентификаторыПоПолнымИменам;
	УстановитьПривилегированныйРежим(Ложь);
	УстановитьОтключениеБезопасногоРежима(Ложь);

	Результат			= Новый Соответствие;
	ПолныеИменаБезКэша	= Новый Массив;
	Для Каждого ОписаниеОбъектаМетаданных Из ОписаниеОбъектовМетаданных Цикл
		ТипОписанияОбъектаМетаданных = ТипЗнч(ОписаниеОбъектаМетаданных);
		Если ТипОписанияОбъектаМетаданных = Тип("Тип") Тогда
			ОбъектМетаданных = Метаданные.НайтиПоТипу(ОписаниеОбъектаМетаданных);
			Если ОбъектМетаданных <> Неопределено Тогда
				ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
			ИначеЕсли Не ВызыватьИсключение Тогда
				Продолжить;
			Иначе
				ВызватьИсключение СтрШаблон("Некорректное значение параметра ОписаниеОбъектовМетаданных функции БазоваяПодсистемаСервер.ОН_ИдентификаторыОбъектовМетаданных:
					           |Указан несуществующий объект метаданных: ""%1"".",
					ОписаниеОбъектаМетаданных);
			КонецЕсли;
		ИначеЕсли ТипОписанияОбъектаМетаданных = Тип("Строка") Тогда
			ПолноеИмя = ОписаниеОбъектаМетаданных;
		ИначеЕсли ТипОписанияОбъектаМетаданных = Тип("ОбъектМетаданных") Тогда
			ПолноеИмя = ОписаниеОбъектаМетаданных.ПолноеИмя();
		ИначеЕсли Не ВызыватьИсключение Тогда
			Продолжить;
		Иначе
			ВызватьИсключение СтрШаблон("Некорректный тип параметра ОписаниеОбъектовМетаданных функции БазоваяПодсистемаСервер.ОН_ИдентификаторыОбъектовМетаданных:
				           |""%1""",
				ТипОписанияОбъектаМетаданных);
		КонецЕсли;
		Идентификатор = ИдентификаторыПоПолнымИменам.Получить(ПолноеИмя);

		Если Идентификатор = Неопределено Тогда
			ПолныеИменаБезКэша.Добавить(ПолноеИмя);
		Иначе
			Результат.Вставить(ПолноеИмя, Идентификатор);
		КонецЕсли;
	КонецЦикла;

	Если ПолныеИменаБезКэша.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Идентификаторы = ИдентификаторыОбъектовМетаданныхСПопыткойПовтора(ПолныеИменаБезКэша,ВызыватьИсключение, ОдинЭлемент);

	Для Каждого КлючИЗначение Из Идентификаторы Цикл
		Результат.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		ИдентификаторыПоПолнымИменам.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;

	Возврат Результат;
КонецФункции

Функция ОбъектМетаданныхПоИдентификатору(Идентификатор, ВызыватьИсключение) Экспорт
	Идентификаторы = Новый Массив;
	Идентификаторы.Добавить(Идентификатор);

	ОбъектыМетаданных = ОбъектыМетаданныхПоИдентификаторам(Идентификаторы, ВызыватьИсключение);

	Если Идентификатор = Неопределено Тогда
		Возврат Null;
	КонецЕсли;

	Возврат ОбъектыМетаданных.Получить(Идентификатор);
КонецФункции

Функция ОбъектыМетаданныхПоИдентификаторам(Идентификаторы, ВызыватьИсключение) Экспорт
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	ОписаниеОбъектовМетаданныхПоИдентификаторам = КэшИдентификаторов().ОписаниеОбъектовМетаданныхПоИдентификаторам;
	УстановитьПривилегированныйРежим(Ложь);
	УстановитьОтключениеБезопасногоРежима(Ложь);

	Результат				= Новый Соответствие;
	ИдентификаторыБезКэша	= Новый Массив;
	Для Каждого Идентификатор Из Идентификаторы Цикл
		Описание = ОписаниеОбъектовМетаданныхПоИдентификаторам.Получить(Идентификатор);

		Если Описание = Неопределено Или ВызыватьИсключение И Описание.Ключ = Неопределено Тогда
			ИдентификаторыБезКэша.Добавить(Идентификатор);
		ИначеЕсли Описание.Ключ = Неопределено Тогда
			Результат.Вставить(Идентификатор, Описание.Объект);
		ИначеЕсли ТипЗнч(Описание.Ключ) = Тип("Тип") Тогда
			Результат.Вставить(Идентификатор, Метаданные.НайтиПоТипу(Описание.Ключ));
		Иначе
			Результат.Вставить(Идентификатор, Метаданные.НайтиПоПолномуИмени(Описание.Ключ));
		КонецЕсли;
	КонецЦикла;

	Если ИдентификаторыБезКэша.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	ОбъектыМетаданныхПоИдентификаторам = ОбъектыМетаданныхПоИдентификаторамСПопыткойПовтора(ИдентификаторыБезКэша, ВызыватьИсключение);
	Для Каждого КлючИЗначение Из ОбъектыМетаданныхПоИдентификаторам Цикл
		ОписаниеОбъектаМетаданных = КлючИЗначение.Значение;
		Если ТипЗнч(ОписаниеОбъектаМетаданных) = Тип("Структура") Тогда
			Результат.Вставить(КлючИЗначение.Ключ, ОписаниеОбъектаМетаданных.Объект);
			ОписаниеОбъектаМетаданных.Объект = Неопределено;
		Иначе
			Результат.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			ОписаниеОбъектаМетаданных = Новый Структура("Объект, Ключ", КлючИЗначение.Значение)
		КонецЕсли;
		ОписаниеОбъектовМетаданныхПоИдентификаторам.Вставить(КлючИЗначение.Ключ, ОписаниеОбъектаМетаданных);
	КонецЦикла;

	Возврат Результат;
КонецФункции

Процедура ОбновитьСвойстваИдентификатора(Объект) Экспорт
	ОбъектыРасширений = ЭтоОбъектРасширений(Объект);

	Если ОбъектыРасширений И Справочники.ИдентификаторыОбъектовРасширений.ОбъектРасширенияОтключен(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;

	ПолноеИмя = Объект.ПолноеИмя;

	// Восстановление старых значений.
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СтарыеЗначения = БазоваяПодсистемаСервер.ОН_ЗначенияРеквизитовОбъекта(
			Объект.Ссылка,
			"Наименование,
			|ПорядокКоллекции,
			|Имя,
			|ПолноеИмя,
			|Синоним,
			|ПолныйСиноним,
			|БезДанных,
			|ЗначениеПустойСсылки,
			|КлючОбъектаМетаданных");
		ЗаполнитьЗначенияСвойств(Объект, СтарыеЗначения);
	КонецЕсли;

	ОбъектМетаданных = МетаданныеНайтиПоПолномуИмени(ПолноеИмя);

	Если ОбъектМетаданных = Неопределено Тогда
		Объект.ПометкаУдаления       = Истина;
		Объект.Родитель              = ПустаяСсылкаСправочника(ОбъектыРасширений);
		Объект.Наименование          = ВставитьЗнакВопроса(Объект.Наименование);
		Объект.Имя                   = ВставитьЗнакВопроса(Объект.Имя);
		Объект.Синоним               = ВставитьЗнакВопроса(Объект.Синоним);
		Объект.ПолноеИмя             = ВставитьЗнакВопроса(Объект.ПолноеИмя);
		Объект.ПолныйСиноним         = ВставитьЗнакВопроса(Объект.ПолныйСиноним);
		Объект.ЗначениеПустойСсылки  = Неопределено;

		Если ОбъектыРасширений Тогда
			Объект.ИмяРасширения      = ВставитьЗнакВопроса(Объект.ИмяРасширения);
			Объект.ХешСуммаРасширения = ВставитьЗнакВопроса(Объект.ХешСуммаРасширения);
		КонецЕсли;

		Если ТипЗнч(Объект) <> Тип("ДанныеФормыСтруктура") Тогда
			Объект.КлючОбъектаМетаданных = Неопределено;
		КонецЕсли;
	Иначе
		Объект.ПометкаУдаления = Ложь;

		ПолноеИмя		= ОбъектМетаданных.ПолноеИмя();
		ПозицияТочки	= СтрНайти(ПолноеИмя, ".");
		ИмяБазовогоТипа	= Лев(ПолноеИмя, ПозицияТочки -1);

		СвойстваКоллекций	= БазоваяПодсистемаСерверПовтИсп.СП_СвойстваКоллекцийОбъектовМетаданных(ОбъектыРасширений);
		Отбор				= Новый Структура("ИмяВЕдЧисле", ИмяБазовогоТипа);
		Строки				= СвойстваКоллекций.НайтиСтроки(Отбор);

		СвойстваОбъектовМетаданных	= СвойстваОбъектовМетаданных(ЭтоОбъектРасширений(Объект), СвойстваКоллекций.Скопировать(Строки));
		СвойстваОбъекта				= СвойстваОбъектовМетаданных.Найти(ПолноеИмя, "ПолноеИмя");

		ЗаполнитьЗначенияСвойств(Объект, СвойстваОбъекта);

		Если ТипЗнч(Объект) <> Тип("ДанныеФормыСтруктура") Тогда
			КлючОбъектаМетаданных = Объект.КлючОбъектаМетаданных.Получить();
			Если КлючОбъектаМетаданных = Неопределено ИЛИ СвойстваОбъекта.БезКлючаОбъектаМетаданных <> (КлючОбъектаМетаданных = Тип("Неопределено")) Тогда
				Объект.КлючОбъектаМетаданных = Новый ХранилищеЗначения(КлючОбъектаМетаданных(СвойстваОбъекта.ПолноеИмя));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ТаблицаПереименованияДляТекущейВерсии() Экспорт
	ТаблицаПереименования = Новый ТаблицаЗначений;
	ТаблицаПереименования.Колонки.Добавить("ПорядокБиблиотеки", Новый ОписаниеТипов("Число"));
	ТаблицаПереименования.Колонки.Добавить("ВерсияЧасть1",      Новый ОписаниеТипов("Число"));
	ТаблицаПереименования.Колонки.Добавить("ВерсияЧасть2",      Новый ОписаниеТипов("Число"));
	ТаблицаПереименования.Колонки.Добавить("ВерсияЧасть3",      Новый ОписаниеТипов("Число"));
	ТаблицаПереименования.Колонки.Добавить("ВерсияЧасть4",      Новый ОписаниеТипов("Число"));
	ТаблицаПереименования.Колонки.Добавить("ПорядокДобавления", Новый ОписаниеТипов("Число"));
	ТаблицаПереименования.Колонки.Добавить("СтароеПолноеИмя",   Новый ОписаниеТипов("Строка"));
	ТаблицаПереименования.Колонки.Добавить("НовоеПолноеИмя",    Новый ОписаниеТипов("Строка"));

	КоллекцииБезКлюча = Новый Соответствие;

	Отбор = Новый Структура("БезКлючаОбъектаМетаданных", Истина);

	КоллекцииБезКлючаОбъектаМетаданных = БазоваяПодсистемаСерверПовтИсп.СП_СвойстваКоллекцийОбъектовМетаданных().НайтиСтроки(Отбор);

	Для каждого Строка Из КоллекцииБезКлючаОбъектаМетаданных Цикл
		КоллекцииБезКлюча.Вставить(ВРег(Строка.ИмяВЕдЧисле), Строка.ИмяВЕдЧисле);
	КонецЦикла;

	Итог = Новый Структура;
	Итог.Вставить("Таблица",			ТаблицаПереименования);
	Итог.Вставить("КоллекцииБезКлюча",	КоллекцииБезКлюча);
	Итог.Вставить("ВерсииБиблиотек",	Новый Соответствие);
	Итог.Вставить("ПорядокБиблиотек",	Новый Соответствие);

	ИнтеграцияПодсистемСервер.ПриДобавленииПереименованийОбъектовМетаданных(Итог);

	ТаблицаПереименования.Сортировать(
		"ПорядокБиблиотеки ВОЗР,
		|ВерсияЧасть1 ВОЗР,
		|ВерсияЧасть2 ВОЗР,
		|ВерсияЧасть3 ВОЗР,
		|ВерсияЧасть4 ВОЗР,
		|ПорядокДобавления ВОЗР");

	Возврат ТаблицаПереименования;
КонецФункции

Функция СвойстваКоллекцийОбъектовМетаданных(ОбъектыРасширений = Ложь) Экспорт
	СвойстваКоллекцийОбъектовМетаданных = Новый ТаблицаЗначений;
	СвойстваКоллекцийОбъектовМетаданных.Колонки.Добавить("Имя",                       Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)));
	СвойстваКоллекцийОбъектовМетаданных.Колонки.Добавить("ИмяВЕдЧисле",               Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)));
	СвойстваКоллекцийОбъектовМетаданных.Колонки.Добавить("Синоним",                   Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(255)));
	СвойстваКоллекцийОбъектовМетаданных.Колонки.Добавить("СинонимВЕдЧисле",           Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(255)));
	СвойстваКоллекцийОбъектовМетаданных.Колонки.Добавить("ПорядокКоллекции",          Новый ОписаниеТипов("Число"));
	СвойстваКоллекцийОбъектовМетаданных.Колонки.Добавить("БезДанных",                 Новый ОписаниеТипов("Булево"));
	СвойстваКоллекцийОбъектовМетаданных.Колонки.Добавить("БезКлючаОбъектаМетаданных", Новый ОписаниеТипов("Булево"));
	СвойстваКоллекцийОбъектовМетаданных.Колонки.Добавить("Идентификатор",             Новый ОписаниеТипов("УникальныйИдентификатор"));
	СвойстваКоллекцийОбъектовМетаданных.Колонки.Добавить("ОбъектыРасширений",         Новый ОписаниеТипов("Булево"));

	// Константы
	Строка					= СвойстваКоллекцийОбъектовМетаданных.Добавить();
	Строка.Идентификатор	= Новый УникальныйИдентификатор("627a6fb8-872a-11e3-bb87-005056c00008");
	Строка.Имя				= "Константы";
	Строка.Синоним			= "Константы";
	Строка.ИмяВЕдЧисле		= "Константа";
	Строка.СинонимВЕдЧисле	= "Константа";

	// Подсистемы
	Строка								= СвойстваКоллекцийОбъектовМетаданных.Добавить();
	Строка.Идентификатор				= Новый УникальныйИдентификатор("cdf5ac50-08e8-46af-9a80-4e63fd4a88ff");
	Строка.Имя							= "Подсистемы";
	Строка.Синоним						= "Подсистемы";
	Строка.ИмяВЕдЧисле					= "Подсистема";
	Строка.СинонимВЕдЧисле				= "Подсистема";
	Строка.БезДанных					= Истина;
	Строка.БезКлючаОбъектаМетаданных	= Истина;
	Строка.ОбъектыРасширений			= Истина;

	// Роли
	Строка								= СвойстваКоллекцийОбъектовМетаданных.Добавить();
	Строка.Идентификатор				= Новый УникальныйИдентификатор("115c4f55-9c20-4e86-a6d0-d0167ec053a1");
	Строка.Имя							= "Роли";
	Строка.Синоним						= "Роли";
	Строка.ИмяВЕдЧисле					= "Роль";
	Строка.СинонимВЕдЧисле				= "Роль";
	Строка.БезДанных					= Истина;
	Строка.БезКлючаОбъектаМетаданных	= Истина;
	Строка.ОбъектыРасширений			= Истина;

	// ПланыОбмена
	Строка						= СвойстваКоллекцийОбъектовМетаданных.Добавить();
	Строка.Идентификатор		= Новый УникальныйИдентификатор("269651e0-4b06-4f9d-aaab-a8d2b6bc6077");
	Строка.Имя					= "ПланыОбмена";
	Строка.Синоним				= "Планы обмена";
	Строка.ИмяВЕдЧисле			= "ПланОбмена";
	Строка.СинонимВЕдЧисле		= "План обмена";
	Строка.ОбъектыРасширений	= Истина;

	// Справочники
	Строка						= СвойстваКоллекцийОбъектовМетаданных.Добавить();
	Строка.Идентификатор		= Новый УникальныйИдентификатор("ede89702-30f5-4a2a-8e81-c3a823b7e161");
	Строка.Имя					= "Справочники";
	Строка.Синоним				= "Справочники";
	Строка.ИмяВЕдЧисле			= "Справочник";
	Строка.СинонимВЕдЧисле		= "Справочник";
	Строка.ОбъектыРасширений	= Истина;

	// Документы
	Строка						= СвойстваКоллекцийОбъектовМетаданных.Добавить();
	Строка.Идентификатор		= Новый УникальныйИдентификатор("96c6ab56-0375-40d5-99a2-b83efa3dac8b");
	Строка.Имя					= "Документы";
	Строка.Синоним				= "Документы";
	Строка.ИмяВЕдЧисле			= "Документ";
	Строка.СинонимВЕдЧисле		= "Документ";
	Строка.ОбъектыРасширений	= Истина;

	// ЖурналыДокументов
	Строка					= СвойстваКоллекцийОбъектовМетаданных.Добавить();
	Строка.Идентификатор	= Новый УникальныйИдентификатор("07938234-e29b-4cff-961a-9af07a4c6185");
	Строка.Имя				= "ЖурналыДокументов";
	Строка.Синоним			= "Журналы документов";
	Строка.ИмяВЕдЧисле		= "ЖурналДокументов";
	Строка.СинонимВЕдЧисле	= "Журнал документов";
	Строка.БезДанных		= Истина;

	// Отчеты
	Строка						= СвойстваКоллекцийОбъектовМетаданных.Добавить();
	Строка.Идентификатор		= Новый УникальныйИдентификатор("706cf832-0ae5-45b5-8a4a-1f251d054f3b");
	Строка.Имя					= "Отчеты";
	Строка.Синоним				= "Отчеты";
	Строка.ИмяВЕдЧисле			= "Отчет";
	Строка.СинонимВЕдЧисле		= "Отчет";
	Строка.БезДанных			= Истина;
	Строка.ОбъектыРасширений	= Истина;

	// Обработки
	Строка						= СвойстваКоллекцийОбъектовМетаданных.Добавить();
	Строка.Идентификатор		= Новый УникальныйИдентификатор("ae480426-487e-40b2-98ba-d207777449f3");
	Строка.Имя					= "Обработки";
	Строка.Синоним				= "Обработки";
	Строка.ИмяВЕдЧисле			= "Обработка";
	Строка.СинонимВЕдЧисле		= "Обработка";
	Строка.БезДанных			= Истина;
	Строка.ОбъектыРасширений	= Истина;

	// ПланыВидовХарактеристик
	Строка						= СвойстваКоллекцийОбъектовМетаданных.Добавить();
	Строка.Идентификатор		= Новый УникальныйИдентификатор("8b5649b9-cdd1-4698-9aac-12ba146835c4");
	Строка.Имя					= "ПланыВидовХарактеристик";
	Строка.Синоним				= "Планы видов характеристик";
	Строка.ИмяВЕдЧисле			= "ПланВидовХарактеристик";
	Строка.СинонимВЕдЧисле		= "План видов характеристик";
	Строка.ОбъектыРасширений	= Истина;

	// ПланыСчетов
	Строка						= СвойстваКоллекцийОбъектовМетаданных.Добавить();
	Строка.Идентификатор		= Новый УникальныйИдентификатор("4295af27-543f-4373-bcfc-c0ace9b7620c");
	Строка.Имя					= "ПланыСчетов";
	Строка.Синоним				= "Планы счетов";
	Строка.ИмяВЕдЧисле			= "ПланСчетов";
	Строка.СинонимВЕдЧисле		= "План счетов";
	Строка.ОбъектыРасширений	= Истина;

	// ПланыВидовРасчета
	Строка						= СвойстваКоллекцийОбъектовМетаданных.Добавить();
	Строка.Идентификатор		= Новый УникальныйИдентификатор("fca3e7e1-1bf1-49c8-9921-aafb4e787c75");
	Строка.Имя					= "ПланыВидовРасчета";
	Строка.Синоним				= "Планы видов расчета";
	Строка.ИмяВЕдЧисле			= "ПланВидовРасчета";
	Строка.СинонимВЕдЧисле		= "План видов расчета";
	Строка.ОбъектыРасширений	= Истина;

	// РегистрыСведений
	Строка						= СвойстваКоллекцийОбъектовМетаданных.Добавить();
	Строка.Идентификатор		= Новый УникальныйИдентификатор("d7ecc1e9-c068-44dd-83c2-1323ec52dbbb");
	Строка.Имя					= "РегистрыСведений";
	Строка.Синоним				= "Регистры сведений";
	Строка.ИмяВЕдЧисле			= "РегистрСведений";
	Строка.СинонимВЕдЧисле		= "Регистр сведений";
	Строка.ОбъектыРасширений	= Истина;

	// РегистрыНакопления
	Строка						= СвойстваКоллекцийОбъектовМетаданных.Добавить();
	Строка.Идентификатор		= Новый УникальныйИдентификатор("74083488-b01e-4441-84a6-c386ce88cdb5");
	Строка.Имя					= "РегистрыНакопления";
	Строка.Синоним				= "Регистры накопления";
	Строка.ИмяВЕдЧисле			= "РегистрНакопления";
	Строка.СинонимВЕдЧисле		= "Регистр накопления";
	Строка.ОбъектыРасширений	= Истина;

	// РегистрыБухгалтерии
	Строка						= СвойстваКоллекцийОбъектовМетаданных.Добавить();
	Строка.Идентификатор		= Новый УникальныйИдентификатор("9a0d75ff-0eda-454e-b2b7-d2412ffdff18");
	Строка.Имя					= "РегистрыБухгалтерии";
	Строка.Синоним				= "Регистры бухгалтерии";
	Строка.ИмяВЕдЧисле			= "РегистрБухгалтерии";
	Строка.СинонимВЕдЧисле		= "Регистр бухгалтерии";
	Строка.ОбъектыРасширений	= Истина;

	// РегистрыРасчета
	Строка						= СвойстваКоллекцийОбъектовМетаданных.Добавить();
	Строка.Идентификатор		= Новый УникальныйИдентификатор("f330686a-0acf-4e26-9cda-108f1404687d");
	Строка.Имя					= "РегистрыРасчета";
	Строка.Синоним				= "Регистры расчета";
	Строка.ИмяВЕдЧисле			= "РегистрРасчета";
	Строка.СинонимВЕдЧисле		= "Регистр расчета";
	Строка.ОбъектыРасширений	= Истина;

	// БизнесПроцессы
	Строка					= СвойстваКоллекцийОбъектовМетаданных.Добавить();
	Строка.Идентификатор	= Новый УникальныйИдентификатор("a8cdd0e0-c27f-4bf0-9718-10ec054dc468");
	Строка.Имя				= "БизнесПроцессы";
	Строка.Синоним			= "Бизнес-процессы";
	Строка.ИмяВЕдЧисле		= "БизнесПроцесс";
	Строка.СинонимВЕдЧисле	= "Бизнес-процесс";

	// Задачи
	Строка					= СвойстваКоллекцийОбъектовМетаданных.Добавить();
	Строка.Идентификатор	= Новый УникальныйИдентификатор("8d9153ad-7cea-4e25-9542-a557ee59fd16");
	Строка.Имя				= "Задачи";
	Строка.Синоним			= "Задачи";
	Строка.ИмяВЕдЧисле		= "Задача";
	Строка.СинонимВЕдЧисле	= "Задача";

	Для каждого Строка Из СвойстваКоллекцийОбъектовМетаданных Цикл
		Строка.ПорядокКоллекции = СвойстваКоллекцийОбъектовМетаданных.Индекс(Строка);
	КонецЦикла;

	Если ОбъектыРасширений Тогда
		СвойстваКоллекцийОбъектовМетаданных = СвойстваКоллекцийОбъектовМетаданных.Скопировать(Новый Структура("ОбъектыРасширений", Истина));
	КонецЕсли;

	СвойстваКоллекцийОбъектовМетаданных.Индексы.Добавить("Идентификатор");

	Возврат СвойстваКоллекцийОбъектовМетаданных;
КонецФункции

Процедура ПередЗаписьюОбъекта(Объект) Экспорт
	ОбъектыРасширений = ЭтоОбъектРасширений(Объект);
	БазоваяПодсистемаСерверПовтИсп.СП_ИдентификаторыОбъектовМетаданныхПроверкаИспользования(, ОбъектыРасширений);

	// Отключение механизма регистрации объектов.
	Объект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");

	// Регистрация объекта на всех узлах РИБ.
	Для Каждого ПланОбмена Из БазоваяПодсистемаСерверПовтИсп.СП_ПланыОбменаРИБ() Цикл
		БазоваяПодсистемаСервер.СП_ЗарегистрироватьОбъектНаВсехУзлах(Объект, ПланОбмена, Ложь);
	КонецЦикла;

	Если Объект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ПроверитьОбъектПередЗаписью(Объект);
КонецПроцедуры

Процедура ПередУдалениемОбъекта(Объект) Экспорт
	ОбъектыРасширений = ЭтоОбъектРасширений(Объект);
	БазоваяПодсистемаСерверПовтИсп.СП_ИдентификаторыОбъектовМетаданныхПроверкаИспользования(, ОбъектыРасширений);

	// Отключение механизма регистрации объектов.
	// Ссылки идентификаторов удаляются независимо во всех узлах
	// через механизм пометки удаления и удаления помеченных объектов.
	Объект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");

	Если Объект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не Объект.ПометкаУдаления Тогда
		ВызватьИсключениеПоОшибке(ОбъектыРасширений,
			"Удаление идентификаторов объектов, у которых значение
			           |реквизита ""Пометка удаления"" установлено Ложь недопустимо.");
	КонецЕсли;
КонецПроцедуры

Процедура ФормаСпискаПриСозданииНаСервере(Форма) Экспорт
	Параметры = Форма.Параметры;
	Элементы  = Форма.Элементы;

	УпорядочитьИОформитьСписок(Форма);

	Если Параметры.РежимВыбора Тогда
		БазоваяПодсистемаСервер.СП_УстановитьКлючНазначенияФормы(Форма, "ВыборПодбор");
		Форма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	Иначе
		Элементы.Список.РежимВыбора = Ложь;
	КонецЕсли;

	Параметры.Свойство("ВыбиратьГруппыОбъектовМетаданных", Форма.ВыбиратьГруппыОбъектовМетаданных);
КонецПроцедуры

Процедура ФормаЭлементаПриСозданииНаСервере(Форма) Экспорт
	ОбъектыРасширений	= ЭтоОбъектРасширений(Форма.Объект.Ссылка);

	Элементы			= Форма.Элементы;

	Форма.ТолькоПросмотр			= Истина;
	Форма.ПустаяСсылкаПредставление	= Строка(ТипЗнч(Форма.Объект.ЗначениеПустойСсылки));

	Если НЕ ПользователиСервер.П_ЭтоПолноправныйПользователь(, Не ОбъектыРасширений)
	 ИЛИ ЗапрещеноИзменятьПолноеИмя(Форма.Объект)
	 ИЛИ Не ОбъектыРасширений И БазоваяПодсистемаСервер.ОН_ЭтоПодчиненныйУзелРИБ()
	 ИЛИ ОбъектыРасширений И Справочники.ИдентификаторыОбъектовРасширений.ОбъектРасширенияОтключен(Форма.Объект.Ссылка) Тогда

		Элементы.ФормаВключитьВозможностьРедактирования.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

Процедура ОбновитьДанные(ЕстьИзменения, ЕстьУдаленные, ТолькоПроверка, ЕстьКритичныеИзменения, СписокКритичныхИзменений, ОбъектыРасширений)
	СвойстваРасширений = Новый Структура;
	СвойстваРасширений.Вставить("ИменаПодключенныхРасширений",		ИменаРасширений(ИсточникРасширенийКонфигурации.СеансАктивные));
	СвойстваРасширений.Вставить("ИменаНеподключенныхРасширений",	ИменаРасширений(ИсточникРасширенийКонфигурации.СеансОтключенные));

	СвойстваОбъектовМетаданных = СвойстваОбъектовМетаданных(ОбъектыРасширений);

	// Найден - состояние, когда для объекта метаданных найден идентификатор.
	СвойстваОбъектовМетаданных.Колонки.Добавить("Найден", Новый ОписаниеТипов("Булево"));

	// Порядок обновления:
	// 1. Переименование объектов метаданных (с учетом нижестоящих подсистем).
	// 2. Обновление предопределенных идентификаторов (коллекций объектов метаданных).
	// 3. Обновление идентификаторов объектов метаданных, которые    имеют ключ  объекта метаданных.
	// 4. Обновление идентификаторов объектов метаданных, которые не имеют ключа объекта метаданных.
	// 5. В процессе 3 и 4 пометка удаления дублей идентификаторов (по полным именам).
	// 6. Добавление новых идентификаторов объектов метаданных.
	// 7. Обновление родителей идентификаторов объектов метаданных и запись обновленных.

	ВерсияРасширений = ПараметрыСеанса.ВерсияРасширений;

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(ИмяСправочника(ОбъектыРасширений));
	Если ОбъектыРасширений Тогда
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ИдентификаторыОбъектовВерсийРасширений");
		ЭлементБлокировки.УстановитьЗначение("ВерсияРасширений", ВерсияРасширений);
	КонецЕсли;

	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();

		Выгрузка = ВыгрузкаВсехИдентификаторов(ОбъектыРасширений);
		Выгрузка.Колонки.Добавить("Обновлен", Новый ОписаниеТипов("Булево"));
		Выгрузка.Колонки.Добавить("ОбъектМетаданных");
		Выгрузка.Колонки.Удалить("НоваяСсылка");

		СписокПереименованийОбъектовМетаданных = "";
		Если НЕ ОбъектыРасширений И НЕ БазоваяПодсистемаСервер.ОН_ЭтоПодчиненныйУзелРИБ() Тогда
			// Переименование полных имен перед обработкой (для РИБ только в главном узле).
			// Для расширений не поддерживается.
			ПереименоватьПолныеИмена(Выгрузка, СписокПереименованийОбъектовМетаданных, ЕстьКритичныеИзменения);
		КонецЕсли;

		ОбработатьИдентификаторыОбъектовМетаданных(Выгрузка, СвойстваОбъектовМетаданных, ОбъектыРасширений, СвойстваРасширений, ЕстьУдаленные, ЕстьКритичныеИзменения, СписокПереименованийОбъектовМетаданных);

		СписокНовыхОбъектовМетаданных = "";
		ДобавитьИдентификаторыНовыхОбъектовМетаданных(Выгрузка, СвойстваОбъектовМетаданных, ОбъектыРасширений, ЕстьКритичныеИзменения, СписокНовыхОбъектовМетаданных);

		СписокКритичныхИзменений = "";
		Если ЗначениеЗаполнено(СписокПереименованийОбъектовМетаданных) Тогда
			СписокКритичныхИзменений = "Переименование идентификаторов объектов метаданных СтароеПолноеИмя -> НовоеПолноеИмя:" + Символы.ПС + СписокПереименованийОбъектовМетаданных + Символы.ПС + Символы.ПС;
		КонецЕсли;
		Если ЗначениеЗаполнено(СписокНовыхОбъектовМетаданных) Тогда
			СписокКритичныхИзменений = СписокКритичныхИзменений + "Добавление новых идентификаторов объектов метаданных:" + Символы.ПС + СписокНовыхОбъектовМетаданных + Символы.ПС;
		КонецЕсли;

		Если Не ТолькоПроверка И Не ОбъектыРасширений И ЗначениеЗаполнено(СписокКритичныхИзменений) И БазоваяПодсистемаСервер.ОН_ЭтоПодчиненныйУзелРИБ() Тогда
			ИмяСобытия = "Идентификаторы объектов метаданных.Требуется загрузить критичные изменения";

			БазоваяПодсистемаСервер.ЖР_ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , СписокКритичныхИзменений);

			ВызватьИсключениеПоОшибке(ОбъектыРасширений,
				"Критичные изменения могут быть выполнены только
				           |в главном узле распределенной информационной базы.
				           |Состав требуемых изменений см. в журнале регистрации.");
		КонецЕсли;

		ОбновитьИдентификаторыОбъектовМетаданных(Выгрузка, СвойстваОбъектовМетаданных, ОбъектыРасширений, СвойстваРасширений, ВерсияРасширений, ЕстьИзменения, ТолькоПроверка);

		Если Не ТолькоПроверка Тогда
			Если ЗначениеЗаполнено(СписокКритичныхИзменений) Тогда
				БазоваяПодсистемаСервер.ЖР_ДобавитьСообщениеДляЖурналаРегистрации(?(ОбъектыРасширений,
						"Идентификаторы объектов расширений.Выполнены критичные изменения",
						"Идентификаторы объектов метаданных.Выполнены критичные изменения"),
					УровеньЖурналаРегистрации.Информация,,,
					СписокКритичныхИзменений);
			КонецЕсли;

			Если Не ОбъектыРасширений И Не БазоваяПодсистемаСервер.ОН_ЭтоПодчиненныйУзелРИБ() Тогда
				ПодготовитьСписокНовыхПодсистемВГлавномУзле(Выгрузка);
			КонецЕсли;
		КонецЕсли;

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

Функция ВыгрузкаВсехИдентификаторов(ОбъектыРасширений = Ложь)
	Запрос			= Новый Запрос;
	Запрос.Текст	=
	"ВЫБРАТЬ
	|	Идентификаторы.Ссылка КАК Ссылка,
	|	Идентификаторы.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	Идентификаторы.Родитель КАК Родитель,
	|	Идентификаторы.ПометкаУдаления КАК ПометкаУдаления,
	|	Идентификаторы.Наименование КАК Наименование,
	|	Идентификаторы.ПорядокКоллекции,
	|	Идентификаторы.Имя,
	|	Идентификаторы.Синоним,
	|	Идентификаторы.ПолноеИмя,
	|	Идентификаторы.ПолныйСиноним,
	|	Идентификаторы.БезДанных,
	|	Идентификаторы.ЗначениеПустойСсылки,
	|	Идентификаторы.КлючОбъектаМетаданных КАК ХранилищеКлюча,
	|	Идентификаторы.НоваяСсылка,
	|	&ИмяРасширения КАК ИмяРасширения,
	|	&ХешСуммаРасширения КАК ХешСуммаРасширения
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК Идентификаторы";
	УточнитьИмяСправочникаВТекстеЗапроса(Запрос.Текст, ОбъектыРасширений);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяРасширения",		?(ОбъектыРасширений, "Идентификаторы.ИмяРасширения", """"""));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ХешСуммаРасширения",	?(ОбъектыРасширений, "Идентификаторы.ХешСуммаРасширения", """"""));

	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выгрузка.Колонки.Добавить("КлючОбъектаМетаданных");
	Выгрузка.Колонки.Добавить("БезКлючаОбъектаМетаданных", Новый ОписаниеТипов("Булево"));
	Выгрузка.Колонки.Добавить("ЭтоКоллекция",              Новый ОписаниеТипов("Булево"));
	Выгрузка.Колонки.Добавить("ЭтоНовый",                  Новый ОписаниеТипов("Булево"));

	// Упорядочение идентификаторов перед обработкой.
	Для каждого Строка Из Выгрузка Цикл
		Если ТипЗнч(Строка.ХранилищеКлюча) = Тип("ХранилищеЗначения") Тогда
			Строка.КлючОбъектаМетаданных = Строка.ХранилищеКлюча.Получить();
		Иначе
			Строка.КлючОбъектаМетаданных = Неопределено;
		КонецЕсли;

		Строка.БезКлючаОбъектаМетаданных = Строка.КлючОбъектаМетаданных = Неопределено ИЛИ Строка.КлючОбъектаМетаданных = Тип("Неопределено");
	КонецЦикла;

	Выгрузка.Индексы.Добавить("Ссылка");
	Выгрузка.Индексы.Добавить("ПолноеИмя");

	СвойстваКоллекций = БазоваяПодсистемаСерверПовтИсп.СП_СвойстваКоллекцийОбъектовМетаданных(ОбъектыРасширений);

	Для каждого СвойстваКоллекции Из СвойстваКоллекций Цикл
		ИдентификаторКоллекции = ИдентификаторКоллекции(СвойстваКоллекции.Идентификатор, ОбъектыРасширений);
		Строка = Выгрузка.Найти(ИдентификаторКоллекции, "Ссылка");
		Если Строка = Неопределено Тогда
			Строка = Выгрузка.Добавить();
			Строка.Ссылка   = ИдентификаторКоллекции;
			Строка.ЭтоНовый = Истина;
		КонецЕсли;
		Строка.ЭтоКоллекция = Истина;
	КонецЦикла;

	Выгрузка.Сортировать("ЭтоКоллекция УБЫВ,
	                     |ПометкаУдаления ВОЗР,
	                     |БезКлючаОбъектаМетаданных ВОЗР");

	Возврат Выгрузка;
КонецФункции

Процедура ПереименоватьПолныеИмена(Выгрузка, СписокПереименованийОбъектовМетаданных = "", ЕстьКритичныеИзменения = Ложь)
	ТаблицаПереименования	= БазоваяПодсистемаСерверПовтИсп.СП_ТаблицаПереименованияДляТекущейВерсии();
	Переименованные			= Новый Соответствие;

	Для Каждого ОписаниеПереименования Из ТаблицаПереименования Цикл
		ДлинаСтарогоПолногоИмени	= СтрДлина(ОписаниеПереименования.СтароеПолноеИмя);
		ЭтоПодсистема				= ВРег(Лев(ОписаниеПереименования.СтароеПолноеИмя, 11)) = ВРег("Подсистема.");

		Для Каждого Строка Из Выгрузка Цикл
			Если Строка.ЭтоКоллекция Тогда
				Продолжить;
			КонецЕсли;

			НовоеПолноеИмя = "";

			Если ЭтоПодсистема Тогда
				Если ВРег(Лев(Строка.ПолноеИмя, ДлинаСтарогоПолногоИмени)) = ВРег(ОписаниеПереименования.СтароеПолноеИмя) Тогда
					НовоеПолноеИмя = ОписаниеПереименования.НовоеПолноеИмя + Сред(Строка.ПолноеИмя, ДлинаСтарогоПолногоИмени + 1);
				КонецЕсли;
			Иначе
				Если ВРег(Строка.ПолноеИмя) = ВРег(ОписаниеПереименования.СтароеПолноеИмя) Тогда
					НовоеПолноеИмя = ОписаниеПереименования.НовоеПолноеИмя;
				КонецЕсли;
			КонецЕсли;

			Если Не ЗначениеЗаполнено(НовоеПолноеИмя) Тогда
				Продолжить;
			КонецЕсли;

			Переименование = Переименованные.Получить(Строка);
			Если Переименование = Неопределено Тогда
				Переименование = Новый Структура;
				Переименование.Вставить("СтароеПолноеИмя", Строка.ПолноеИмя);
				Переименование.Вставить("НовоеПолноеИмя",  НовоеПолноеИмя);
				Переименованные.Вставить(Строка, Переименование);
			Иначе
				Переименование.НовоеПолноеИмя = НовоеПолноеИмя;
			КонецЕсли;
			Строка.ПолноеИмя = НовоеПолноеИмя;
		КонецЦикла;
	КонецЦикла;

	Для Каждого Строка Из Выгрузка Цикл
		Переименование = Переименованные.Получить(Строка);
		Если Переименование = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ЕстьКритичныеИзменения					= Истина;
		СписокПереименованийОбъектовМетаданных	= СписокПереименованийОбъектовМетаданных + ?(ЗначениеЗаполнено(СписокПереименованийОбъектовМетаданных), "," + Символы.ПС, "") + Переименование.СтароеПолноеИмя + " -> " + Переименование.НовоеПолноеИмя;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработатьИдентификаторыОбъектовМетаданных(Выгрузка, СвойстваОбъектовМетаданных, ОбъектыРасширений, СвойстваРасширений, ЕстьУдаленные, ЕстьКритичныеИзменения, СписокПереименованийОбъектовМетаданных)
	// Обработка идентификаторов объектов метаданных.
	Для Каждого Свойства Из Выгрузка Цикл
		// Проверка и обновление свойств идентификаторов коллекций объектов метаданных.
		Если Свойства.ЭтоКоллекция Тогда
			ПроверитьОбновитьСвойстваКоллекции(Свойства, ОбъектыРасширений);
			Продолжить;
		КонецЕсли;

		Если ОбъектыРасширений И СвойстваРасширений.ИменаНеподключенныхРасширений[Свойства.ИмяРасширения] <> Неопределено Тогда
			// Для случаев, когда расширение было временно отключено, а затем подключено обратно,
			// предотвращаем удаление помеченных элементов и связанных с ними данных.
			Продолжить;
		КонецЕсли;

		Если ОбъектыРасширений И СвойстваРасширений.ИменаПодключенныхРасширений[Свойства.ИмяРасширения] = Неопределено Тогда
			СвойстваОбновлены = Ложь;
			ОбновитьСвойстваПомеченногоНаУдаление(Свойства, СвойстваОбновлены, ЕстьУдаленные);
			Если СвойстваОбновлены Тогда
				Свойства.Обновлен = Истина;
			КонецЕсли;
		КонецЕсли;

		КлючОбъектаМетаданных	= Свойства.КлючОбъектаМетаданных;
		ОбъектМетаданных		= ОбъектМетаданныхПоКлючу(КлючОбъектаМетаданных);

		Если ОбъектМетаданных = Неопределено Тогда
			// Если объект метаданных без ключа, то его можно найти только по полному имени.
			ОбъектМетаданных = МетаданныеНайтиПоПолномуИмени(Свойства.ПолноеИмя);
			Если ОбъектМетаданных = Неопределено И ОбъектыРасширений Тогда
				ОбъектМетаданных = МетаданныеРасширенияНайтиПоПолномуИмени(Свойства);
			КонецЕсли;
		Иначе
			// Если объект метаданных удалялся с целью реструктуризации, тогда
			// старый идентификатор нужно использовать для нового объекта метаданных,
			// а для старых объектов метаданных создать новые идентификаторы.
			Если ВРег(Лев(ОбъектМетаданных.Имя, СтрДлина("Удалить"))) =  ВРег("Удалить") И ВРег(Лев(Свойства.Имя, СтрДлина("Удалить"))) <> ВРег("Удалить") Тогда
				НовыйОбъектМетаданных = МетаданныеНайтиПоПолномуИмени(Свойства.ПолноеИмя);
				Если НовыйОбъектМетаданных <> Неопределено Тогда
					ОбъектМетаданных		= НовыйОбъектМетаданных;
					КлючОбъектаМетаданных	= Неопределено; // Чтобы выполнить обновление идентификатора.
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		// Если объект метаданных найден по ключу или полному имени,
		// тогда нужно подготовить строку свойств объекта метаданных.
		Если ОбъектМетаданных <> Неопределено Тогда
			СвойстваОбъекта = СвойстваОбъектовМетаданных.Найти(ОбъектМетаданных.ПолноеИмя(), "ПолноеИмя");
			Если СвойстваОбъекта = Неопределено Тогда
				ОбъектМетаданных = Неопределено;
			Иначе
				Свойства.ОбъектМетаданных = ОбъектМетаданных;
			КонецЕсли;
		КонецЕсли;

		Если ОбъектМетаданных = Неопределено ИЛИ СвойстваОбъекта.Найден Тогда
			// Если объект метаданных не найден или найден повторно
			// тогда идентификатор требуется пометить на удаление.
			ЭтоДубль			= ОбъектМетаданных <> Неопределено И СвойстваОбъекта.Найден;
			СвойстваОбновлены	= Ложь;
			ОбновитьСвойстваПомеченногоНаУдаление(Свойства, СвойстваОбновлены, ЕстьУдаленные, ЭтоДубль);
			Если СвойстваОбновлены Тогда
				Свойства.Обновлен = Истина;
			КонецЕсли;
		Иначе
			// Обновление свойств существующих объектов метаданных, если изменились.
			СвойстваОбъекта.Найден = Истина;
			Если Свойства.Наименование              <> СвойстваОбъекта.Наименование
			 ИЛИ Свойства.ПорядокКоллекции          <> СвойстваОбъекта.ПорядокКоллекции
			 ИЛИ Свойства.Имя                       <> СвойстваОбъекта.Имя
			 ИЛИ Свойства.Синоним                   <> СвойстваОбъекта.Синоним
			 ИЛИ Свойства.ПолноеИмя                 <> СвойстваОбъекта.ПолноеИмя
			 ИЛИ Свойства.ПолныйСиноним             <> СвойстваОбъекта.ПолныйСиноним
			 ИЛИ Свойства.БезДанных                 <> СвойстваОбъекта.БезДанных
			 ИЛИ Свойства.ЗначениеПустойСсылки      <> СвойстваОбъекта.ЗначениеПустойСсылки
			 ИЛИ Свойства.ИмяРасширения             <> СвойстваОбъекта.ИмяРасширения
			 ИЛИ Свойства.ХешСуммаРасширения        <> СвойстваОбъекта.ХешСуммаРасширения
			 ИЛИ Свойства.ИмяПредопределенныхДанных <> СвойстваОбъекта.ИмяПредопределенныхДанных
			 ИЛИ Свойства.ПометкаУдаления
			 ИЛИ КлючОбъектаМетаданных = Неопределено
			 ИЛИ СвойстваОбъекта.БезКлючаОбъектаМетаданных <> (КлючОбъектаМетаданных = Тип("Неопределено")) Тогда
				Если ВРег(Свойства.ПолноеИмя) <> ВРег(СвойстваОбъекта.ПолноеИмя) Тогда
					ЕстьКритичныеИзменения					= Истина;
					СписокПереименованийОбъектовМетаданных	= СписокПереименованийОбъектовМетаданных + ?(ЗначениеЗаполнено(СписокПереименованийОбъектовМетаданных), "," + Символы.ПС, "") + Свойства.ПолноеИмя + " -> " + СвойстваОбъекта.ПолноеИмя;
				КонецЕсли;

				// Установка новых свойств идентификатора объекта метаданных.
				ЗаполнитьЗначенияСвойств(Свойства, СвойстваОбъекта);

				Свойства.ИмяПредопределенныхДанных = СвойстваОбъекта.ИмяПредопределенныхДанных;

				Если КлючОбъектаМетаданных = Неопределено ИЛИ СвойстваОбъекта.БезКлючаОбъектаМетаданных <> (КлючОбъектаМетаданных = Тип("Неопределено")) Тогда
					Свойства.КлючОбъектаМетаданных = КлючОбъектаМетаданных(СвойстваОбъекта.ПолноеИмя);
				КонецЕсли;

				Свойства.ПометкаУдаления	= Ложь;
				Свойства.Обновлен			= Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция МетаданныеРасширенияНайтиПоПолномуИмени(Свойства)
	Если Свойства.ИмяРасширения = "" Или Не СтрНачинаетсяС(Свойства.ПолноеИмя, "?") Тогда
		Возврат Неопределено;
	КонецЕсли;

	// Восстановление связи с идентификатором объекта метаданных расширения,
	// которое было временно удалено и восстанавливается.
	ПозицияСкобки		= СтрНайти(Свойства.ПолноеИмя, "(");
	ИсходноеПолноеИмя	= Сред(Свойства.ПолноеИмя, 3, ПозицияСкобки - 4);
	ОбъектМетаданных	= МетаданныеНайтиПоПолномуИмени(ИсходноеПолноеИмя);

	Если ОбъектМетаданных = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	РасширениеОбъекта = ОбъектМетаданных.РасширениеКонфигурации();

	Если РасширениеОбъекта = Неопределено Или РасширениеОбъекта.Имя <> Сред(Свойства.ИмяРасширения, 3) Или Base64Строка(РасширениеОбъекта.ХешСумма) <> Сред(Свойства.ХешСуммаРасширения, 3) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат ОбъектМетаданных;
КонецФункции

Процедура ДобавитьИдентификаторыНовыхОбъектовМетаданных(Выгрузка, СвойстваОбъектовМетаданных, ОбъектыРасширений, ЕстьКритичныеИзменения, СписокНовыхОбъектовМетаданных)
	СвойстваОбъектов = СвойстваОбъектовМетаданных.НайтиСтроки(Новый Структура("Найден", Ложь));

	Для Каждого СвойстваОбъекта Из СвойстваОбъектов Цикл
		Свойства						= Выгрузка.Добавить();
		ЗаполнитьЗначенияСвойств(Свойства, СвойстваОбъекта);
		Свойства.ЭтоНовый				= Истина;
		Свойства.Ссылка					= НоваяСсылкаСправочника(ОбъектыРасширений);
		Свойства.ПометкаУдаления		= Ложь;
		Свойства.ОбъектМетаданных		= СвойстваОбъекта.ОбъектМетаданных;
		Свойства.КлючОбъектаМетаданных	= КлючОбъектаМетаданных(Свойства.ПолноеИмя);
		ЕстьКритичныеИзменения			= Истина;
		СписокНовыхОбъектовМетаданных	= СписокНовыхОбъектовМетаданных + ?(ЗначениеЗаполнено(СписокНовыхОбъектовМетаданных), "," + Символы.ПС, "") + СвойстваОбъекта.ПолноеИмя;
	КонецЦикла;
КонецПроцедуры

Процедура ОбновитьИдентификаторыОбъектовМетаданных(Выгрузка, СвойстваОбъектовМетаданных, ОбъектыРасширений, СвойстваРасширений, ВерсияРасширений, ЕстьИзменения, ТолькоПроверка)
	Если ОбъектыРасширений Тогда
		НаборЗаписей			= РегистрыСведений.ИдентификаторыОбъектовВерсийРасширений.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияРасширений.Установить(ВерсияРасширений);
		НаборЗаписей.Прочитать();
		ТаблицаЗаписей			= НаборЗаписей.Выгрузить();
		ТаблицаЗаписей.Колонки.Добавить("Удалить", Новый ОписаниеТипов("Булево"));
		ТаблицаЗаписей.ЗаполнитьЗначения(Истина, "Удалить");
		ТаблицаЗаписей.Индексы.Добавить("Идентификатор, ПолноеИмяОбъекта, ВерсияРасширений");
		ОбновитьНаборЗаписей	= Ложь;
	КонецЕсли;

	Для Каждого Свойства Из Выгрузка Цикл
		// Обновление родителей идентификаторов объектов метаданных.
		Если Не Свойства.ЭтоКоллекция Тогда
			СвойстваОбъекта	= СвойстваОбъектовМетаданных.Найти(Свойства.ПолноеИмя, "ПолноеИмя");
			НовыйРодитель	= ПустаяСсылкаСправочника(ОбъектыРасширений);

			Если СвойстваОбъекта <> Неопределено Тогда
				Если Не ЗначениеЗаполнено(СвойстваОбъекта.ПолноеИмяРодителя) Тогда
					// Коллекция объектов метаданных.
					НовыйРодитель = СвойстваОбъекта.Родитель;
				Иначе
					// Не коллекция объектов метаданных, например, подсистема.
					ОписаниеРодителя = Выгрузка.Найти(СвойстваОбъекта.ПолноеИмяРодителя, "ПолноеИмя");
					Если ОписаниеРодителя <> Неопределено Тогда
						НовыйРодитель = ОписаниеРодителя.Ссылка;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

			Если Свойства.Родитель <> НовыйРодитель Тогда
				Свойства.Родитель = НовыйРодитель;
				Свойства.Обновлен = Истина;
			КонецЕсли;

			Если ОбъектыРасширений И Свойства.ПометкаУдаления = Ложь И СвойстваРасширений.ИменаНеподключенныхРасширений[Свойства.ИмяРасширения] = Неопределено Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("ВерсияРасширений", ВерсияРасширений);
				Отбор.Вставить("Идентификатор",    Свойства.Ссылка);
				Отбор.Вставить("ПолноеИмяОбъекта", Свойства.ПолноеИмя);
				Строки = ТаблицаЗаписей.НайтиСтроки(Отбор);
				Если Строки.Количество() = 0 Тогда
					ОбновитьНаборЗаписей = Истина;
					ЗаполнитьЗначенияСвойств(ТаблицаЗаписей.Добавить(), Отбор);
				Иначе
					Строки[0].Удалить = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		// Обновление идентификаторов объектов метаданных.
		Если Свойства.ЭтоНовый Тогда
			ТаблицаОбъект = СоздатьЭлементСправочника(ОбъектыРасширений);
			ТаблицаОбъект.УстановитьСсылкуНового(Свойства.Ссылка);
		ИначеЕсли Свойства.Обновлен Тогда
			ТаблицаОбъект = Свойства.Ссылка.ПолучитьОбъект();
		Иначе
			Продолжить;
		КонецЕсли;

		ЕстьИзменения = Истина;
		Если ТолькоПроверка Тогда
			Возврат;
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(ТаблицаОбъект, Свойства);
		ТаблицаОбъект.КлючОбъектаМетаданных	= Новый ХранилищеЗначения(Свойства.КлючОбъектаМетаданных);
		ТаблицаОбъект.ОбменДанными.Загрузка	= Истина;
		ПроверитьОбъектПередЗаписью(ТаблицаОбъект, Истина);
		ТаблицаОбъект.Записать();
	КонецЦикла;

	Если ОбъектыРасширений Тогда
		ТаблицаЗаписей.Индексы.Добавить("Удалить");
		Строки = ТаблицаЗаписей.НайтиСтроки(Новый Структура("Удалить", Истина));
		Если Строки.Количество() > 0 Тогда
			ОбновитьНаборЗаписей = Истина;
			Для Каждого Строка Из Строки Цикл
				ТаблицаЗаписей.Удалить(Строка);
			КонецЦикла;
		КонецЕсли;
		Если ТаблицаЗаписей.Количество() = 0 И ЗначениеЗаполнено(ВерсияРасширений) Тогда
			// Добавление записи, если в расширении нет объектов метаданных,
			// чтобы при проверке наличия кэша, получить значение Истина.
			ТаблицаЗаписей.Добавить().ВерсияРасширений = ВерсияРасширений;
			ОбновитьНаборЗаписей = Истина;
		КонецЕсли;
		Если ОбновитьНаборЗаписей Тогда
			ЕстьИзменения = Истина;
			Если ТолькоПроверка Тогда
				Возврат;
			КонецЕсли;
			НаборЗаписей.Загрузить(ТаблицаЗаписей);
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбновитьСвойстваПомеченногоНаУдаление(Свойства, СвойстваОбновлены = Ложь, ЕстьУдаленные = Ложь, ЭтоДубль = Ложь)
	ОбъектыРасширений = ЭтоОбъектРасширений(Свойства.Ссылка);

	Если НЕ Свойства.ПометкаУдаления
	 ИЛИ ЗначениеЗаполнено(Свойства.Родитель)
	 ИЛИ Лев(Свойства.Наименование, 1)  <> "?"
	 ИЛИ Лев(Свойства.Имя, 1)           <> "?"
	 ИЛИ Лев(Свойства.Синоним, 1)       <> "?"
	 ИЛИ Лев(Свойства.ПолноеИмя, 1)     <> "?"
	 ИЛИ Лев(Свойства.ПолныйСиноним, 1) <> "?"
	 ИЛИ ОбъектыРасширений И Лев(Свойства.ИмяРасширения, 1)      <> "?"
	 ИЛИ ОбъектыРасширений И Лев(Свойства.ХешСуммаРасширения, 1) <> "?"
	 ИЛИ СтрНайти(Свойства.ПолноеИмя, "(") = 0
	 ИЛИ Свойства.ЗначениеПустойСсылки  <> Неопределено
	 ИЛИ Свойства.ИмяПредопределенныхДанных <> ""
	 ИЛИ ЭтоДубль Тогда
		Если НЕ Свойства.ПометкаУдаления Или Лев(Свойства.ПолноеИмя, 1) <> "?" Тогда
			ЕстьУдаленные = Истина;
		КонецЕсли;

		// Установка новых свойств идентификатора объекта метаданных.
		Свойства.ПометкаУдаления			= Истина;
		Свойства.Родитель					= ПустаяСсылкаСправочника(ЭтоОбъектРасширений(Свойства.Ссылка));
		Свойства.Наименование				= ВставитьЗнакВопроса(Свойства.Наименование);
		Свойства.Имя						= ВставитьЗнакВопроса(Свойства.Имя);
		Свойства.Синоним					= ВставитьЗнакВопроса(Свойства.Синоним);
		Свойства.ПолноеИмя					= УникальноеПолноеИмя(Свойства);
		Свойства.ПолныйСиноним				= ВставитьЗнакВопроса(Свойства.ПолныйСиноним);
		Свойства.ЗначениеПустойСсылки		= Неопределено;
		Свойства.ИмяПредопределенныхДанных	= "";

		Если ОбъектыРасширений Тогда
			Свойства.ИмяРасширения      = ВставитьЗнакВопроса(Свойства.ИмяРасширения);
			Свойства.ХешСуммаРасширения = ВставитьЗнакВопроса(Свойства.ХешСуммаРасширения);
		КонецЕсли;

		Если ЭтоДубль Тогда
			Если ТипЗнч(Свойства.КлючОбъектаМетаданных) = Тип("ХранилищеЗначения") Тогда
				Свойства.КлючОбъектаМетаданных = Новый ХранилищеЗначения(Неопределено);
			Иначе
				Свойства.КлючОбъектаМетаданных = Неопределено;
			КонецЕсли;
		КонецЕсли;
		СвойстваОбновлены = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьОбновитьСвойстваКоллекции(Знач ТекущиеСвойства, ОбъектыРасширений)
	СвойстваКоллекций	= БазоваяПодсистемаСерверПовтИсп.СП_СвойстваКоллекцийОбъектовМетаданных(ОбъектыРасширений);
	НовыеСвойства		= СвойстваКоллекций.Найти(ТекущиеСвойства.Ссылка.УникальныйИдентификатор(), "Идентификатор");

	НаименованиеКоллекции = НовыеСвойства.Синоним;

	Если ТекущиеСвойства.Наименование              <> НаименованиеКоллекции
	 ИЛИ ТекущиеСвойства.ПорядокКоллекции          <> НовыеСвойства.ПорядокКоллекции
	 ИЛИ ТекущиеСвойства.Имя                       <> НовыеСвойства.Имя
	 ИЛИ ТекущиеСвойства.Синоним                   <> НовыеСвойства.Синоним
	 ИЛИ ТекущиеСвойства.ПолноеИмя                 <> НовыеСвойства.Имя
	 ИЛИ ТекущиеСвойства.ПолныйСиноним             <> НовыеСвойства.Синоним
	 ИЛИ ТекущиеСвойства.БезДанных                 <> Ложь
	 ИЛИ ТекущиеСвойства.ЗначениеПустойСсылки      <> Неопределено
	 ИЛИ ТекущиеСвойства.ИмяПредопределенныхДанных <> ""
	 ИЛИ ТекущиеСвойства.ПометкаУдаления           <> Ложь
	 ИЛИ ТекущиеСвойства.КлючОбъектаМетаданных     <> Неопределено Тогда

		// Установка новых свойств.
		ТекущиеСвойства.Наименование              = НаименованиеКоллекции;
		ТекущиеСвойства.ПорядокКоллекции          = НовыеСвойства.ПорядокКоллекции;
		ТекущиеСвойства.Имя                       = НовыеСвойства.Имя;
		ТекущиеСвойства.Синоним                   = НовыеСвойства.Синоним;
		ТекущиеСвойства.ПолноеИмя                 = НовыеСвойства.Имя;
		ТекущиеСвойства.ПолныйСиноним             = НовыеСвойства.Синоним;
		ТекущиеСвойства.БезДанных                 = Ложь;
		ТекущиеСвойства.ЗначениеПустойСсылки      = Неопределено;
		ТекущиеСвойства.ИмяПредопределенныхДанных = "";
		ТекущиеСвойства.ПометкаУдаления           = Ложь;
		ТекущиеСвойства.КлючОбъектаМетаданных     = Неопределено;

		ТекущиеСвойства.Обновлен = Истина;
	КонецЕсли;
КонецПроцедуры

Функция КлючОбъектаМетаданных(ПолноеИмя)
	ПозицияТочки = СтрНайти(ПолноеИмя, ".");

	КлассОМ = Лев( ПолноеИмя, ПозицияТочки-1);
	ИмяОМ   = Сред(ПолноеИмя, ПозицияТочки+1);

	Если ВРег(КлассОМ) = ВРег("ПланОбмена") Тогда
		Возврат Тип(КлассОМ + "Ссылка." + ИмяОМ);
	ИначеЕсли ВРег(КлассОМ) = ВРег("Константа") Тогда
		Возврат ТипЗнч(БазоваяПодсистемаСервер.ОН_МенеджерОбъектаПоПолномуИмени(ПолноеИмя));
	ИначеЕсли ВРег(КлассОМ) = ВРег("Справочник") Тогда
		Возврат Тип(КлассОМ + "Ссылка." + ИмяОМ);
	ИначеЕсли ВРег(КлассОМ) = ВРег("Документ") Тогда
		Возврат Тип(КлассОМ + "Ссылка." + ИмяОМ);
	ИначеЕсли ВРег(КлассОМ) = ВРег("ЖурналДокументов") Тогда
		Возврат ТипЗнч(БазоваяПодсистемаСервер.ОН_МенеджерОбъектаПоПолномуИмени(ПолноеИмя));
	ИначеЕсли ВРег(КлассОМ) = ВРег("Отчет") Тогда
		Возврат Тип(КлассОМ + "Объект." + ИмяОМ);
	ИначеЕсли ВРег(КлассОМ) = ВРег("Обработка") Тогда
		Возврат Тип(КлассОМ + "Объект." + ИмяОМ);
	ИначеЕсли ВРег(КлассОМ) = ВРег("ПланВидовХарактеристик") Тогда
		Возврат Тип(КлассОМ + "Ссылка." + ИмяОМ);
	ИначеЕсли ВРег(КлассОМ) = ВРег("ПланСчетов") Тогда
		Возврат Тип(КлассОМ + "Ссылка." + ИмяОМ);
	ИначеЕсли ВРег(КлассОМ) = ВРег("ПланВидовРасчета") Тогда
		Возврат Тип(КлассОМ + "Ссылка." + ИмяОМ);
	ИначеЕсли ВРег(КлассОМ) = ВРег("РегистрСведений") Тогда
		Возврат Тип(КлассОМ + "КлючЗаписи." + ИмяОМ);
	ИначеЕсли ВРег(КлассОМ) = ВРег("РегистрНакопления") Тогда
		Возврат Тип(КлассОМ + "КлючЗаписи." + ИмяОМ);
	ИначеЕсли ВРег(КлассОМ) = ВРег("РегистрБухгалтерии") Тогда
		Возврат Тип(КлассОМ + "КлючЗаписи." + ИмяОМ);
	ИначеЕсли ВРег(КлассОМ) = ВРег("РегистрРасчета") Тогда
		Возврат Тип(КлассОМ + "КлючЗаписи." + ИмяОМ);
	ИначеЕсли ВРег(КлассОМ) = ВРег("БизнесПроцесс") Тогда
		Возврат Тип(КлассОМ + "Ссылка." + ИмяОМ);
	ИначеЕсли ВРег(КлассОМ) = ВРег("Задача") Тогда
		Возврат Тип(КлассОМ + "Ссылка." + ИмяОМ);
	Иначе
		// Без ключа объекта метаданных.
		Возврат Тип("Неопределено");
	КонецЕсли;
КонецФункции

Функция КлючОбъектаМетаданныхСоответствуетПолномуИмени(СвойстваИдентификатора)
	РезультатПроверки = Новый Структура;
	РезультатПроверки.Вставить("НеСоответствует", Истина);
	РезультатПроверки.Вставить("КлючОбъектаМетаданных", Неопределено);

	КлючОбъектаМетаданных	= СвойстваИдентификатора.КлючОбъектаМетаданных.Получить();
	ОбъектыРасширений		= ЭтоОбъектРасширений(СвойстваИдентификатора.Ссылка);

	Если КлючОбъектаМетаданных <> Неопределено И КлючОбъектаМетаданных <> Тип("Неопределено") Тогда
		// Ключ задан, поиск объекта метаданных по ключу.
		РезультатПроверки.Вставить("КлючОбъектаМетаданных", КлючОбъектаМетаданных);
		ОбъектМетаданных = ОбъектМетаданныхПоКлючу(КлючОбъектаМетаданных);
		Если ОбъектМетаданных <> Неопределено Тогда
			РезультатПроверки.НеСоответствует = ОбъектМетаданных.ПолноеИмя() <> СвойстваИдентификатора.ПолноеИмя;
		КонецЕсли;
	Иначе
		// Ключ не задан, поиск объекта метаданных по полному имени.
		ОбъектМетаданных = МетаданныеНайтиПоПолномуИмени(СвойстваИдентификатора.ПолноеИмя);
		Если ОбъектМетаданных = Неопределено Тогда
			// Возможно задана коллекция

			Строка = БазоваяПодсистемаСерверПовтИсп.СП_СвойстваКоллекцийОбъектовМетаданных(ОбъектыРасширений).Найти(СвойстваИдентификатора.Ссылка.УникальныйИдентификатор(), "Идентификатор");
			Если Строка <> Неопределено Тогда
				ОбъектМетаданных					= Метаданные[Строка.Имя];
				РезультатПроверки.НеСоответствует	= Строка.Имя <> СвойстваИдентификатора.ПолноеИмяКоллекции;
			КонецЕсли;
		Иначе
			РезультатПроверки.НеСоответствует = Ложь;
		КонецЕсли;
	КонецЕсли;

	РезультатПроверки.Вставить("ОбъектМетаданных", ОбъектМетаданных);
	РезультатПроверки.Вставить("ОбъектМетаданныхУдаленного", Неопределено);
	РезультатПроверки.Вставить("ПредставлениеУдаленного", "");

	Если ОбъектМетаданных = Неопределено
	   И СвойстваИдентификатора.ПометкаУдаления
	   И СтрНачинаетсяС(СвойстваИдентификатора.ПолноеИмяКоллекции, "? ") Тогда

		РезультатПроверки.ОбъектМетаданныхУдаленного = Метаданные.НайтиПоПолномуИмени(ПолноеИмяУдаленного(СвойстваИдентификатора.ПолноеИмяКоллекции));
	КонецЕсли;
	Если СтрНачинаетсяС(Строка(СвойстваИдентификатора.Представление), "? ") Тогда
		РезультатПроверки.ПредставлениеУдаленного = Сред(Строка(СвойстваИдентификатора.Представление), 3);
	КонецЕсли;

	Возврат РезультатПроверки;
КонецФункции

Функция ЗапрещеноИзменятьПолноеИмя(Объект)
	ОбъектыРасширений = ЭтоОбъектРасширений(Объект);
	Если ЭтоКоллекция(Объект.Ссылка, ОбъектыРасширений) Тогда
		Возврат Истина;
	КонецЕсли;

	ПозицияТочки = СтрНайти(Объект.ПолноеИмя, ".");
	ИмяБазовогоТипа = Лев(Объект.ПолноеИмя, ПозицияТочки -1);

	СвойстваКоллекций = БазоваяПодсистемаСерверПовтИсп.СП_СвойстваКоллекцийОбъектовМетаданных(ОбъектыРасширений);
	СвойстваКоллекции = СвойстваКоллекций.Найти(ИмяБазовогоТипа, "ИмяВЕдЧисле");

	Если СвойстваКоллекции <> Неопределено И НЕ СвойстваКоллекции.БезКлючаОбъектаМетаданных Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
КонецФункции

Функция ОбъектМетаданныхПоКлючу(КлючОбъектаМетаданных)
	ОбъектМетаданных = Неопределено;

	Если ТипЗнч(КлючОбъектаМетаданных) = Тип("Тип") Тогда
		ОбъектМетаданных = Метаданные.НайтиПоТипу(КлючОбъектаМетаданных);
	КонецЕсли;

	Возврат ОбъектМетаданных;
КонецФункции

Функция СвойстваОбъектовМетаданных(ОбъектыРасширений, СвойстваКоллекций = Неопределено)
	МассивТиповРодителя = Новый Массив;
	МассивТиповРодителя.Добавить(ТипЗнч(ПустаяСсылкаСправочника(ОбъектыРасширений)));

	СвойстваОбъектовМетаданных = Новый ТаблицаЗначений;
	СвойстваОбъектовМетаданных.Колонки.Добавить("Наименование",              Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150)));
	СвойстваОбъектовМетаданных.Колонки.Добавить("ПолноеИмя",                 Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(510)));
	СвойстваОбъектовМетаданных.Колонки.Добавить("ПолноеИмяРодителя",         Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(510)));
	СвойстваОбъектовМетаданных.Колонки.Добавить("ПорядокКоллекции",          Новый ОписаниеТипов("Число"));
	СвойстваОбъектовМетаданных.Колонки.Добавить("Родитель",                  Новый ОписаниеТипов(МассивТиповРодителя));
	СвойстваОбъектовМетаданных.Колонки.Добавить("Имя",                       Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150)));
	СвойстваОбъектовМетаданных.Колонки.Добавить("ИмяПредопределенныхДанных", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(255)));
	СвойстваОбъектовМетаданных.Колонки.Добавить("Синоним",                   Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(255)));
	СвойстваОбъектовМетаданных.Колонки.Добавить("ПолныйСиноним",             Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(510)));
	СвойстваОбъектовМетаданных.Колонки.Добавить("БезДанных",                 Новый ОписаниеТипов("Булево"));
	СвойстваОбъектовМетаданных.Колонки.Добавить("БезКлючаОбъектаМетаданных", Новый ОписаниеТипов("Булево"));
	СвойстваОбъектовМетаданных.Колонки.Добавить("ИмяРасширения",             Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(128)));
	СвойстваОбъектовМетаданных.Колонки.Добавить("ХешСуммаРасширения",        Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(30)));
	СвойстваОбъектовМетаданных.Колонки.Добавить("ЗначениеПустойСсылки");
	СвойстваОбъектовМетаданных.Колонки.Добавить("ОбъектМетаданных");

	Если СвойстваКоллекций = Неопределено Тогда
		СвойстваКоллекций = БазоваяПодсистемаСерверПовтИсп.СП_СвойстваКоллекцийОбъектовМетаданных(ОбъектыРасширений);
	КонецЕсли;

	ИменаПредопределенныхДанных = ?(ОбъектыРасширений, Метаданные.Справочники.ИдентификаторыОбъектовРасширений, Метаданные.Справочники.ИдентификаторыОбъектовМетаданных).ПолучитьИменаПредопределенных();

	ИменаПредопределенных = Новый Соответствие;
	Для Каждого ИмяПредопределенного Из ИменаПредопределенныхДанных Цикл
		ИменаПредопределенных.Вставить(ИмяПредопределенного, Ложь);
	КонецЦикла;

	Если Не ОбъектыРасширений Или ЗначениеЗаполнено(ПараметрыСеанса.ПодключенныеРасширения) Тогда
		Для каждого СвойстваКоллекции Из СвойстваКоллекций Цикл
			ДобавитьСвойстваОбъектовМетаданных(Метаданные[СвойстваКоллекции.Имя], СвойстваКоллекции, СвойстваОбъектовМетаданных, ОбъектыРасширений, ИменаПредопределенных);
		КонецЦикла;
		СвойстваОбъектовМетаданных.Индексы.Добавить("ПолноеИмя");
	КонецЕсли;

	Возврат СвойстваОбъектовМетаданных;
КонецФункции

Процедура ДобавитьСвойстваОбъектовМетаданных(Знач КоллекцияОбъектовМетаданных, Знач СвойстваКоллекции, Знач СвойстваОбъектовМетаданных, Знач ОбъектыРасширений, Знач ИменаПредопределенных, Знач ПолноеИмяРодителя = "", Знач ПолныйСинонимРодителя = "")
	Для Каждого ОбъектМетаданных Из КоллекцияОбъектовМетаданных Цикл
		ПолноеИмя			= ОбъектМетаданных.ПолноеИмя();
		Расширение			= ОбъектМетаданных.РасширениеКонфигурации();
		ИмяРасширения		= ?(Расширение = Неопределено, "", Расширение.Имя);
		ХешСуммаРасширения	= ?(Расширение = Неопределено, "", Base64Строка(Расширение.ХешСумма));
		Если ЗначениеЗаполнено(ИмяРасширения) <> ОбъектыРасширений Тогда
			Продолжить;
		КонецЕсли;

		Если СтрНайти(СвойстваКоллекции.ИмяВЕдЧисле, "Подсистема") <> 0 Тогда
			МетаданныеНайтиПоПолномуИмени(ПолноеИмя);
		КонецЕсли;

		Если Не СвойстваКоллекции.БезДанных И Не ОбъектыРасширений И Не БазоваяПодсистемаСервер.СП_ЭтоТаблицаРегистра(СвойстваКоллекции.ИмяВЕдЧисле) И СтрНайти(СвойстваКоллекции.ИмяВЕдЧисле, "Константа") = 0 Тогда
			ИмяТипаСсылки			= СвойстваКоллекции.ИмяВЕдЧисле + "Ссылка." + ОбъектМетаданных.Имя;
			ОписаниеТипа			= Новый ОписаниеТипов(ИмяТипаСсылки);
			ЗначениеПустойСсылки	= ОписаниеТипа.ПривестиЗначение(Неопределено);
		Иначе
			ЗначениеПустойСсылки	= Неопределено;
		КонецЕсли;

		НоваяСтрока							= СвойстваОбъектовМетаданных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СвойстваКоллекции);
		НоваяСтрока.Родитель				= ИдентификаторКоллекции(СвойстваКоллекции.Идентификатор, ОбъектыРасширений);
		НоваяСтрока.Наименование			= ПредставлениеОбъектаМетаданных(ОбъектМетаданных, СвойстваКоллекции);
		НоваяСтрока.ПолноеИмя				= ПолноеИмя;
		НоваяСтрока.ПолноеИмяРодителя		= ПолноеИмяРодителя;
		НоваяСтрока.Имя						= ОбъектМетаданных.Имя;
		НоваяСтрока.Синоним					= ?(ЗначениеЗаполнено(ОбъектМетаданных.Синоним), ОбъектМетаданных.Синоним, ОбъектМетаданных.Имя);
		НоваяСтрока.ПолныйСиноним			= ПолныйСинонимРодителя + СвойстваКоллекции.СинонимВЕдЧисле + ". " + НоваяСтрока.Синоним;
		НоваяСтрока.ЗначениеПустойСсылки	= ЗначениеПустойСсылки;
		НоваяСтрока.ОбъектМетаданных		= ОбъектМетаданных;
		НоваяСтрока.ИмяРасширения			= ИмяРасширения;
		НоваяСтрока.ХешСуммаРасширения		= ХешСуммаРасширения;

		Если СвойстваКоллекции.Имя = "Подсистемы" Тогда
			ДобавитьСвойстваОбъектовМетаданных(ОбъектМетаданных.Подсистемы, СвойстваКоллекции, СвойстваОбъектовМетаданных, ОбъектыРасширений, ИменаПредопределенных, ПолноеИмя, НоваяСтрока.ПолныйСиноним + ". ");
		КонецЕсли;
		ИмяПредопределенного = СтрЗаменить(ПолноеИмя, ".", "");
		Если ИменаПредопределенных.Получить(ИмяПредопределенного) <> Неопределено Тогда
			НоваяСтрока.ИмяПредопределенныхДанных = ИмяПредопределенного;
			ИменаПредопределенных.Вставить(ИмяПредопределенного, Истина);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПредставлениеОбъектаМетаданных(Знач ОбъектМетаданных, Знач СвойстваКоллекции)
	Постфикс = "(" + СвойстваКоллекции.СинонимВЕдЧисле + ")";

	Синоним = ?(ЗначениеЗаполнено(ОбъектМетаданных.Синоним), ОбъектМетаданных.Синоним, ОбъектМетаданных.Имя);

	МаксимальнаяДлинаСинонима = 150 - СтрДлина(Постфикс);
	Если СтрДлина(Синоним) > МаксимальнаяДлинаСинонима + 1 Тогда
		Возврат Лев(Синоним, МаксимальнаяДлинаСинонима - 2) + "..." + Постфикс;
	КонецЕсли;

	Возврат Синоним + " (" + СвойстваКоллекции.СинонимВЕдЧисле + ")";
КонецФункции

Функция ВставитьЗнакВопроса(Знач Строка)
	Если Не СтрНачинаетсяС(Строка, "?") Тогда
		Если Не СтрНачинаетсяС(Строка, " ") Тогда
			Строка = "? " + Строка;
		Иначе
			Строка = "?" + Строка;
		КонецЕсли;
	КонецЕсли;

	Возврат Строка;
КонецФункции

Функция УникальноеПолноеИмя(Свойства)
	ПолноеИмя = ВставитьЗнакВопроса(Свойства.ПолноеИмя);

	Если СтрНайти(ПолноеИмя, "(") = 0 Тогда
		ПолноеИмя = ПолноеИмя + " (" + Строка(Свойства.Ссылка.УникальныйИдентификатор())+ ")";
	КонецЕсли;

	Возврат ПолноеИмя;
КонецФункции

Функция МетаданныеНайтиПоПолномуИмени(ПолноеИмя)
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);

	Если ОбъектМетаданных = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	ПолноеИмяОбъекта = ОбъектМетаданных.ПолноеИмя();

	Если ВРег(ПолноеИмяБезИменКоллекций(ПолноеИмяОбъекта)) <> ВРег(ПолноеИмяБезИменКоллекций(ПолноеИмя)) Тогда
		Если СтрНачинаетсяС(ВРег(ПолноеИмяОбъекта), ВРег("Подсистема.")) Тогда
			ПолноеИмяДляПоиска	= СтрЗаменить(ПолноеИмяБезИменКоллекций(ПолноеИмя), "#", "Подсистема.");
			Подсистема			= НайтиПодсистемуПоПолномуИмени(ПолноеИмяДляПоиска);
			Если Подсистема = Неопределено Тогда
				Возврат Неопределено;
			КонецЕсли;
			ВызватьИсключение СтрШаблон("Ошибка при поиске дочерней подсистемы по полному имени (при поиске ""%1"" была найдена ""%2"").
				           |Не следует называть подсистемы одинаково, либо использовать более новую версию платформы.",
				ПолноеИмя,
				ОбъектМетаданных.ПолноеИмя());
		Иначе
			ВызватьИсключение СтрШаблон("Ошибка при поиске объекта метаданных по полному имени (при поиске ""%1"" был найден ""%2"").",
				ПолноеИмя,
				ОбъектМетаданных.ПолноеИмя());
		КонецЕсли;
	КонецЕсли;

	Возврат ОбъектМетаданных;
КонецФункции

Функция ПолноеИмяБезИменКоллекций(ПолноеИмя)
	ЧастиПолногоИмени = СтрРазделить(ПолноеИмя, ".");

	Индекс = ЧастиПолногоИмени.ВГраница();
	Если Цел((Индекс + 1) / 2) * 2 <> (Индекс + 1) Тогда
		Возврат ПолноеИмя;
	КонецЕсли;

	Пока Индекс > 0 Цикл
		Индекс						= Индекс - 1;
		ЧастиПолногоИмени[Индекс]	= "#";
		Индекс						= Индекс - 1;
	КонецЦикла;

	Возврат СтрСоединить(ЧастиПолногоИмени, ".");
КонецФункции

Функция НайтиПодсистемуПоПолномуИмени(ПолноеИмя, КоллекцияПодсистемы = Неопределено)
	Если КоллекцияПодсистемы = Неопределено Тогда
		КоллекцияПодсистемы = Метаданные.Подсистемы;
	КонецЕсли;

	ОстатокИмени	= Сред(ПолноеИмя, СтрДлина("Подсистема.") + 1);
	Позиция			= СтрНайти(ВРег(ОстатокИмени), ВРег("Подсистема."));
	Если Позиция > 0 Тогда
		ИмяПодсистемы	= Лев(ОстатокИмени, Позиция - 2);
		ОстатокИмени	= Сред(ПолноеИмя, Позиция + СтрДлина("Подсистема."));
	Иначе
		ИмяПодсистемы	= ОстатокИмени;
		ОстатокИмени	= Неопределено;
	КонецЕсли;

	НайденнаяПодсистема = Неопределено;
	Для каждого Подсистема Из КоллекцияПодсистемы Цикл
		Если ВРег(Подсистема.Имя) = ВРег(ИмяПодсистемы) Тогда
			НайденнаяПодсистема = Подсистема;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если НайденнаяПодсистема = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если ОстатокИмени = Неопределено Тогда
		Возврат НайденнаяПодсистема;
	КонецЕсли;

	Возврат НайтиПодсистемуПоПолномуИмени(ОстатокИмени, НайденнаяПодсистема.Подсистемы);
КонецФункции

Функция ПолноеИмяИспользуется(Объект, ОбъектыРасширения)
	Запрос			= Новый Запрос;
	Запрос.Текст	=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЗначениеИстина
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|ГДЕ
	|	ИдентификаторыОбъектовМетаданных.Ссылка <> &Ссылка
	|	И ИдентификаторыОбъектовМетаданных.ПолноеИмя = &ПолноеИмя";
	Запрос.УстановитьПараметр("ПолноеИмя", Объект.ПолноеИмя);
	Запрос.УстановитьПараметр("Ссылка",    Объект.Ссылка);
	УточнитьИмяСправочникаВТекстеЗапроса(Запрос.Текст, ОбъектыРасширения);

	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции

Функция ЭтоКоллекция(Ссылка, ОбъектыРасширений = Ложь)
	СвойстваКоллекций = БазоваяПодсистемаСерверПовтИсп.СП_СвойстваКоллекцийОбъектовМетаданных(ОбъектыРасширений);

	Возврат СвойстваКоллекций.Найти(Ссылка.УникальныйИдентификатор(), "Идентификатор") <> Неопределено;
КонецФункции

Процедура ПодготовитьСписокНовыхПодсистемВГлавномУзле(Выгрузка)
	НайденноеОписание = Выгрузка.Найти(Метаданные.Подсистемы.СтандартныеПодсистемы, "ОбъектМетаданных");
	Если НайденноеОписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПодсистемаСтандартныеПодсистемы = НайденноеОписание.Ссылка;

	Отбор = Новый Структура;
	Отбор.Вставить("ЭтоНовый", Истина);
	Отбор.Вставить("Родитель", ПодсистемаСтандартныеПодсистемы);
	НайденныеОписания = Выгрузка.НайтиСтроки(Отбор);

	НаследующиеПодсистемы = Новый Массив;
	// Зарезервировано для новых подсистем

	НовыеПодсистемы = Новый Массив;
	Для Каждого Описание Из НайденныеОписания Цикл
		Если НаследующиеПодсистемы.Найти(Описание) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НовыеПодсистемы.Добавить(Описание.ПолноеИмя);
	КонецЦикла;

	ОбновитьСписокНовыхПодсистем(НовыеПодсистемы);
КонецПроцедуры

Процедура ОбновитьСписокНовыхПодсистем(НовыеПодсистемы)
	Сведения		= ОбновлениеВерсииИБСервер.сОИБ_СведенияОбОбновленииИнформационнойБазы();
	ЕстьИзменения	= Ложь;

	Для Каждого ИмяПодсистемы Из НовыеПодсистемы Цикл
		Если Сведения.НовыеПодсистемы.Найти(ИмяПодсистемы) = Неопределено Тогда
			Сведения.НовыеПодсистемы.Добавить(ИмяПодсистемы);
			ЕстьИзменения = Истина;
		КонецЕсли;
	КонецЦикла;

	// Удаление из списка подсистем, удаленных из метаданных.
	Индекс = Сведения.НовыеПодсистемы.Количество() - 1;
	Пока Индекс >= 0 Цикл
		ИмяПодсистемы = Сведения.НовыеПодсистемы.Получить(Индекс);
		Если Метаданные.НайтиПоПолномуИмени(ИмяПодсистемы) = Неопределено Тогда
			Сведения.НовыеПодсистемы.Удалить(Индекс);
			ЕстьИзменения = Истина;
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;

	Если Не ЕстьИзменения Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеВерсииИБСервер.сОИБ_ЗаписатьСведенияОбОбновленииИнформационнойБазы(Сведения);
КонецПроцедуры

Функция ИдентификаторКоллекции(УникальныйИдентификатор, ОбъектыРасширений)
	Если ОбъектыРасширений Тогда
		Возврат Справочники.ИдентификаторыОбъектовРасширений.ПолучитьСсылку(УникальныйИдентификатор);
	Иначе
		Возврат ПолучитьСсылку(УникальныйИдентификатор);
	КонецЕсли;
КонецФункции

Функция ЭтоОбъектРасширений(ОбъектИлиСсылка)
	Возврат ТипЗнч(ОбъектИлиСсылка) = Тип("СправочникОбъект.ИдентификаторыОбъектовРасширений") Или ТипЗнч(ОбъектИлиСсылка) = Тип("СправочникСсылка.ИдентификаторыОбъектовРасширений");
КонецФункции

Функция СоздатьЭлементСправочника(ОбъектыРасширений)
	Если ОбъектыРасширений Тогда
		Возврат Справочники.ИдентификаторыОбъектовРасширений.СоздатьЭлемент();
	Иначе
		Возврат СоздатьЭлемент();
	КонецЕсли;
КонецФункции

Функция ПустаяСсылкаСправочника(ОбъектыРасширений)
	Если ОбъектыРасширений Тогда
		Возврат Справочники.ИдентификаторыОбъектовРасширений.ПустаяСсылка();
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция НоваяСсылкаСправочника(ОбъектыРасширений)
	Если ОбъектыРасширений Тогда
		Возврат Справочники.ИдентификаторыОбъектовРасширений.ПолучитьСсылку();
	Иначе
		Возврат ПолучитьСсылку();
	КонецЕсли;
КонецФункции

Функция ИмяСправочника(ОбъектыРасширений)
	Если ОбъектыРасширений Тогда
		Возврат "Справочник.ИдентификаторыОбъектовРасширений";
	Иначе
		Возврат "Справочник.ИдентификаторыОбъектовМетаданных";
	КонецЕсли;
КонецФункции

Функция НазваниеСправочника(ОбъектыРасширений)
	Если ОбъектыРасширений Тогда
		НазваниеСправочника = "Идентификаторы объектов расширений";
	Иначе
		НазваниеСправочника = "Идентификаторы объектов метаданных";
	КонецЕсли;

	Возврат НазваниеСправочника;
КонецФункции

Процедура УточнитьИмяСправочникаВТекстеЗапроса(ТекстЗапроса, ОбъектыРасширений)
	Если ОбъектыРасширений Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Справочник.ИдентификаторыОбъектовМетаданных", ИмяСправочника(ОбъектыРасширений));
	КонецЕсли;
КонецПроцедуры

Процедура ВызватьИсключениеПоОшибке(ОбъектыРасширений, ТекстОшибки)
	ЗаголовокОшибки = СтрШаблон("Ошибка при работе со справочником ""%1"".", НазваниеСправочника(ОбъектыРасширений));

	ВызватьИсключение ЗаголовокОшибки + Символы.ПС + Символы.ПС + ТекстОшибки;
КонецПроцедуры

Функция ЭтоПодсистема(ОбъектМетаданных, КоллекцияПодсистем = Неопределено)
	Если КоллекцияПодсистем = Неопределено Тогда
		КоллекцияПодсистем = Метаданные.Подсистемы;
	КонецЕсли;

	Если КоллекцияПодсистем.Содержит(ОбъектМетаданных) Тогда
		Возврат Истина;
	КонецЕсли;

	Для Каждого Подсистема Из КоллекцияПодсистем Цикл
		Если ЭтоПодсистема(ОбъектМетаданных, Подсистема.Подсистемы) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;
КонецФункции

Процедура ПроверитьОбъектПередЗаписью(Объект, АвтоматическоеОбновление = Ложь)
	ОбъектыРасширений = ЭтоОбъектРасширений(Объект);

	Если НЕ АвтоматическоеОбновление Тогда
		Если Объект.ЭтоНовый() Тогда
			ВызватьИсключениеПоОшибке(ОбъектыРасширений,
				"Создание нового идентификатора объекта
				           |возможно только автоматически при обновлении данных справочника.");
		ИначеЕсли ЗапрещеноИзменятьПолноеИмя(Объект) Тогда
			ВызватьИсключениеПоОшибке(ОбъектыРасширений, СтрШаблон(
				"При изменении идентификатора объекта указано
				           |полное имя ""%1"", которое может быть
				           |установлено только автоматически при обновлении данных справочника.",
				Объект.ПолноеИмя));
		Иначе
			Если ПолноеИмяИспользуется(Объект, Ложь) Тогда
				НазваниеСправочника = НазваниеСправочника(Ложь);
			ИначеЕсли ОбъектыРасширений И ПолноеИмяИспользуется(Объект, Истина) Тогда
				НазваниеСправочника = НазваниеСправочника(Истина);
			Иначе
				НазваниеСправочника = "";
			КонецЕсли;
			Если ЗначениеЗаполнено(НазваниеСправочника) Тогда
				ВызватьИсключениеПоОшибке(ОбъектыРасширений, СтрШаблон(
					"При изменении идентификатора объекта указано
					           |полное имя ""%1"",
					           |которое уже используется в справочнике ""%2"".",
					Объект.ПолноеИмя, НазваниеСправочника));
			КонецЕсли;
		КонецЕсли;

		ОбновитьСвойстваИдентификатора(Объект);
	КонецЕсли;

	Если Не ОбъектыРасширений И БазоваяПодсистемаСервер.ОН_ЭтоПодчиненныйУзелРИБ() Тогда
		Если Объект.ЭтоНовый() И Не ЭтоКоллекция(Объект.ПолучитьСсылкуНового(), ЭтоОбъектРасширений(Объект)) Тогда
			ВызватьИсключениеПоОшибке(ОбъектыРасширений,
				"Добавление новых элементов может быть выполнено
				           |только в главном узле распределенной информационной базы.");
		КонецЕсли;

		Если Не Объект.ПометкаУдаления И Не ЭтоКоллекция(Объект.Ссылка, ЭтоОбъектРасширений(Объект)) Тогда
			Если ВРег(Объект.ПолноеИмя) <> ВРег(БазоваяПодсистемаСервер.ОН_ЗначениеРеквизитаОбъекта(Объект.Ссылка, "ПолноеИмя")) Тогда
				ВызватьИсключениеПоОшибке(ОбъектыРасширений,
					"Изменение реквизита ""Полное имя"" может быть выполнено
					           |только в главном узле распределенной информационной базы.");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура УпорядочитьИОформитьСписок(Форма)
	// Порядок.
	Порядок											= Форма.Список.КомпоновщикНастроек.Настройки.Порядок;
	Порядок.ИдентификаторПользовательскойНастройки	= "ОсновнойПорядок";

	Порядок.Элементы.Очистить();

	ЭлементПорядка						= Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле					= Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	ЭлементПорядка.ТипУпорядочивания	= НаправлениеСортировкиКомпоновкиДанных.Возр;
	ЭлементПорядка.РежимОтображения		= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементПорядка.Использование		= Истина;

	ЭлементПорядка						= Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле					= Новый ПолеКомпоновкиДанных("ПорядокКоллекции");
	ЭлементПорядка.ТипУпорядочивания	= НаправлениеСортировкиКомпоновкиДанных.Возр;
	ЭлементПорядка.РежимОтображения		= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементПорядка.Использование		= Истина;

	ЭлементПорядка						= Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле					= Новый ПолеКомпоновкиДанных("Родитель");
	ЭлементПорядка.ТипУпорядочивания	= НаправлениеСортировкиКомпоновкиДанных.Возр;
	ЭлементПорядка.РежимОтображения		= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементПорядка.Использование		= Истина;

	ЭлементПорядка						= Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле					= Новый ПолеКомпоновкиДанных("ПометкаБудущегоУдаления");
	ЭлементПорядка.ТипУпорядочивания	= НаправлениеСортировкиКомпоновкиДанных.Возр;
	ЭлементПорядка.РежимОтображения		= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементПорядка.Использование		= Истина;

	ЭлементПорядка						= Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле					= Новый ПолеКомпоновкиДанных("Синоним");
	ЭлементПорядка.ТипУпорядочивания	= НаправлениеСортировкиКомпоновкиДанных.Возр;
	ЭлементПорядка.РежимОтображения		= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементПорядка.Использование		= Истина;

	// Оформление.
	ЭлементОформления					= Форма.Список.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;

	ЭлементЦвета						= ЭлементОформления.Оформление.Элементы.Найти("TextColor");
	ЭлементЦвета.Значение				= Метаданные.ЭлементыСтиля.ТекстЗапрещеннойЯчейкиЦвет.Значение;
	ЭлементЦвета.Использование			= Истина;

	ЭлементГруппыОтбора					= ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ЭлементГруппыОтбора.ТипГруппы		= ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ЭлементОтбора						= ЭлементГруппыОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение			= Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	ЭлементОтбора.ВидСравнения			= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение		= Истина;
	ЭлементОтбора.Использование			= Истина;

	ЭлементОтбора						= ЭлементГруппыОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение			= Новый ПолеКомпоновкиДанных("ПометкаБудущегоУдаления");
	ЭлементОтбора.ВидСравнения			= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение		= Истина;
	ЭлементОтбора.Использование			= Истина;
КонецПроцедуры

Функция ИменаРасширений(ИсточникРасширений)
	ИменаРасширений	= Новый Соответствие;
	Расширения		= РасширенияКонфигурации.Получить(, ИсточникРасширений); // Массив из РасширениеКонфигурации

	Для Каждого Расширение Из Расширения Цикл
		ИменаРасширений.Вставить(Расширение.Имя, Истина);
	КонецЦикла;

	Возврат ИменаРасширений;
КонецФункции

Функция ИдентификаторыОбъектовМетаданныхСПопыткойПовтора(ПолныеИменаОбъектовМетаданных, ВызыватьИсключение, ОдинЭлемент)
	БазоваяПодсистемаСерверПовтИсп.СП_ИдентификаторыОбъектовМетаданныхПроверкаИспользования(Истина, Истина);

	Попытка
		Идентификаторы = ИдентификаторыОбъектовМетаданныхБезПопыткиПовтора(ПолныеИменаОбъектовМетаданных, Истина, ОдинЭлемент, Истина);
	Исключение
		Идентификаторы = Неопределено;
	КонецПопытки;

	Если Идентификаторы = Неопределено Тогда
		ОбновитьДанныеСправочника();

		Справочники.ИдентификаторыОбъектовРасширений.ОбновитьДанныеСправочника();

		Идентификаторы = ИдентификаторыОбъектовМетаданныхБезПопыткиПовтора(ПолныеИменаОбъектовМетаданных, ВызыватьИсключение, ОдинЭлемент, Не ВызыватьИсключение);
	КонецЕсли;

	Возврат Идентификаторы;
КонецФункции


Функция ИдентификаторыОбъектовМетаданныхБезПопыткиПовтора(ПолныеИменаОбъектовМетаданных, ВызыватьИсключение, ОдинЭлемент, ПропускатьНеподдерживаемыеОбъекты)
	УстановитьПривилегированныйРежим(Истина);

	ДоступныИдентификаторыОбъектовРасширений = ЗначениеЗаполнено(ПараметрыСеанса.ПодключенныеРасширения);

	Запрос			= Новый Запрос;
	Запрос.Текст	=
	"ВЫБРАТЬ
	|	Идентификаторы.Ссылка КАК Ссылка,
	|	Идентификаторы.КлючОбъектаМетаданных КАК КлючОбъектаМетаданных,
	|	Идентификаторы.ПолноеИмя КАК ПолноеИмя,
	|	Идентификаторы.Наименование КАК Представление,
	|	Идентификаторы.ПолноеИмя КАК ПолноеИмяКоллекции
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК Идентификаторы
	|ГДЕ
	|	Идентификаторы.ПолноеИмя В (&ПолныеИмена)
	|	И НЕ Идентификаторы.ПометкаУдаления";
	Запрос.УстановитьПараметр("ПолныеИмена", ПолныеИменаОбъектовМетаданных);

	Если ДоступныИдентификаторыОбъектовРасширений Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВерсииИдентификаторов.Идентификатор КАК Ссылка,
		|	Идентификаторы.КлючОбъектаМетаданных КАК КлючОбъектаМетаданных,
		|	ВерсииИдентификаторов.ПолноеИмяОбъекта КАК ПолноеИмя,
		|	Идентификаторы.Наименование КАК Представление,
		|	Идентификаторы.ПолноеИмя КАК ПолноеИмяКоллекции
		|ИЗ
		|	РегистрСведений.ИдентификаторыОбъектовВерсийРасширений КАК ВерсииИдентификаторов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовРасширений КАК Идентификаторы
		|		ПО (Идентификаторы.Ссылка = ВерсииИдентификаторов.Идентификатор)
		|			И (ВерсииИдентификаторов.ВерсияРасширений = &ВерсияРасширений)
		|ГДЕ
		|	ВерсииИдентификаторов.ПолноеИмяОбъекта В (&ПолныеИмена)";

		Запрос.Текст = Запрос.Текст + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|" + ТекстЗапроса;
		Запрос.УстановитьПараметр("ВерсияРасширений", ПараметрыСеанса.ВерсияРасширений);
	КонецЕсли;

	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выгрузка.Индексы.Добавить("ПолноеИмя");

	Ошибки															= Новый Массив;
	ДобавитьУточнениеОшибкиПараметровРаботыПрограммыДляРазработчика	= Ложь;

	КонфигурацияБазыДанныхИзмененаДинамически						= КонфигурацияБазыДанныхИзмененаДинамически();
	ИдентификаторыИзКлючей											= Неопределено;

	Результат	= Новый Соответствие;
	Для Каждого ПолноеИмяОбъектаМетаданных Из ПолныеИменаОбъектовМетаданных Цикл
		Отбор			= Новый Структура("ПолноеИмя", ПолноеИмяОбъектаМетаданных);
		НайденныеСтроки	= Выгрузка.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 0 Тогда
			// Если идентификатор не найден по полному имени, возможно что полное имя задано с ошибкой.
			ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъектаМетаданных);
			Если ОбъектМетаданных = Неопределено Тогда
				Если Не ВызыватьИсключение Тогда
					Продолжить;
				КонецЕсли;
				ОписаниеОшибки = СтрШаблон("Объект метаданных с именем ""%1"" не существует.", ПолноеИмяОбъектаМетаданных);
				Ошибки.Добавить(ОписаниеОшибки);
				Продолжить;
			КонецЕсли;

			Если Не Метаданные.Роли.Содержит(ОбъектМетаданных)
			   И Не Метаданные.ПланыОбмена.Содержит(ОбъектМетаданных)
			   И Не Метаданные.Константы.Содержит(ОбъектМетаданных)
			   И Не Метаданные.Справочники.Содержит(ОбъектМетаданных)
			   И Не Метаданные.Документы.Содержит(ОбъектМетаданных)
			   И Не Метаданные.ЖурналыДокументов.Содержит(ОбъектМетаданных)
			   И Не Метаданные.Отчеты.Содержит(ОбъектМетаданных)
			   И Не Метаданные.Обработки.Содержит(ОбъектМетаданных)
			   И Не Метаданные.ПланыВидовХарактеристик.Содержит(ОбъектМетаданных)
			   И Не Метаданные.ПланыСчетов.Содержит(ОбъектМетаданных)
			   И Не Метаданные.ПланыВидовРасчета.Содержит(ОбъектМетаданных)
			   И Не Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных)
			   И Не Метаданные.РегистрыНакопления.Содержит(ОбъектМетаданных)
			   И Не Метаданные.РегистрыБухгалтерии.Содержит(ОбъектМетаданных)
			   И Не Метаданные.РегистрыРасчета.Содержит(ОбъектМетаданных)
			   И Не Метаданные.БизнесПроцессы.Содержит(ОбъектМетаданных)
			   И Не Метаданные.Задачи.Содержит(ОбъектМетаданных)
			   И Не ЭтоПодсистема(ОбъектМетаданных) Тогда

				Если ПропускатьНеподдерживаемыеОбъекты Тогда
					Продолжить;
				КонецЕсли;

				ОписаниеОшибки = СтрШаблон("Объект метаданных не поддерживается:
					           |""%1"".
					           |
					           |Допустимы только типы объектов метаданных перечисленные в комментарии к функции.",
					ПолноеИмяОбъектаМетаданных);
				Ошибки.Добавить(ОписаниеОшибки);
				Продолжить;
			КонецЕсли;

			Расширение = ОбъектМетаданных.РасширениеКонфигурации();

			Если КонфигурацияБазыДанныхИзмененаДинамически Тогда
				Если ИдентификаторыИзКлючей = Неопределено Тогда
					ИдентификаторыИзКлючей = ИдентификаторыИзКлючей();
				КонецЕсли;
				Идентификатор = ИдентификаторыИзКлючей.Получить(ПолноеИмяОбъектаМетаданных);
				Если Идентификатор = Неопределено Тогда
					ВызватьИсключение "Версия программы обновлена, требуется перезапустить сеанс.";
				КонецЕсли;
				Результат.Вставить(ПолноеИмяОбъектаМетаданных, Идентификатор);

				Продолжить;
			КонецЕсли;

			ШаблонОшибки = ?(Расширение <> Неопределено,
				"Для объекта метаданных ""%1""
				           |не существует идентификатор в регистре сведений ""Идентификаторы объектов версий расширений"".",
				"Для объекта метаданных ""%1""
				           |не существует идентификатор в справочнике ""Идентификаторы объектов метаданных"".");
			ОписаниеОшибки = СтрШаблон(ШаблонОшибки, ПолноеИмяОбъектаМетаданных);
			ДобавитьУточнениеОшибкиПараметровРаботыПрограммыДляРазработчика = Истина;
			Ошибки.Добавить(ОписаниеОшибки);

			Продолжить;
		ИначеЕсли НайденныеСтроки.Количество() > 1 Тогда
			ШаблонОшибки = ?(ДоступныИдентификаторыОбъектовРасширений,
				"Для объекта метаданных ""%1""
				           |найдено несколько идентификаторов в справочнике ""Идентификаторы объектов метаданных"" и
				           |регистре сведений ""Идентификаторы объектов версий расширений"".",
				"Для объекта метаданных ""%1""
				           |найдено несколько идентификаторов в справочнике ""Идентификаторы объектов метаданных"".");
			ОписаниеОшибки = СтрШаблон(ШаблонОшибки, ПолноеИмяОбъектаМетаданных);
			ДобавитьУточнениеОшибкиПараметровРаботыПрограммыДляРазработчика = Истина;
			Ошибки.Добавить(ОписаниеОшибки);

			Продолжить;
		КонецЕсли;

		// Проверка соответствия ключа объекта метаданных полному имени объекта метаданных.
		СтрокаТаблицы = НайденныеСтроки[0];
		РезультатПроверки = КлючОбъектаМетаданныхСоответствуетПолномуИмени(СтрокаТаблицы);
		Если РезультатПроверки.НеСоответствует Тогда
			НазваниеСправочника = НазваниеСправочника(ЭтоОбъектРасширений(СтрокаТаблицы.Ссылка));

			Если РезультатПроверки.ОбъектМетаданных = Неопределено Тогда
				ОписаниеОшибки = СтрШаблон("Для объекта метаданных ""%1""
					           |найден идентификатор в справочнике ""%2"",
					           |которому соответствует удаленный объект метаданных.",
					ПолноеИмяОбъектаМетаданных, НазваниеСправочника);
			Иначе
				ОписаниеОшибки = СтрШаблон("Для объекта метаданных ""%1""
					           |найден идентификатор в справочнике ""%2"",
					           |который соответствует другому объекту метаданных ""%3"".",
					ПолноеИмяОбъектаМетаданных, НазваниеСправочника, РезультатПроверки.ОбъектМетаданных);
			КонецЕсли;

			ДобавитьУточнениеОшибкиПараметровРаботыПрограммыДляРазработчика = Истина;
			Ошибки.Добавить(ОписаниеОшибки);

			Продолжить;
		КонецЕсли;

		Результат.Вставить(ПолноеИмяОбъектаМетаданных, СтрокаТаблицы.Ссылка);
	КонецЦикла;

	КоличествоОшибок = Ошибки.Количество();
	Если КоличествоОшибок > 0 Тогда
		Если ОдинЭлемент Тогда
			ЗаголовокОшибки = "Ошибка при выполнении функции БазоваяПодсистемаСервер.ОН_ИдентификаторОбъектаМетаданных.";
		ИначеЕсли КоличествоОшибок = 1 Тогда
			ЗаголовокОшибки = "Ошибка при выполнении функции БазоваяПодсистемаСервер.ОН_ИдентификаторыОбъектовМетаданных.";
		Иначе
			ЗаголовокОшибки = "Ошибки при выполнении функции БазоваяПодсистемаСервер.ОН_ИдентификаторыОбъектовМетаданных.";
		КонецЕсли;

		Разделитель		= Символы.ПС + Символы.ПС;
		ТекстВсехОшибок	= "";
		НомерОшибки		= 0;
		Для Каждого ОписаниеОшибки Из Ошибки Цикл
			НомерОшибки		= НомерОшибки + 1;
			ТекстВсехОшибок	= ТекстВсехОшибок + ?(НомерОшибки = 1, "", Разделитель) + ОписаниеОшибки;
			Если НомерОшибки = 3 И КоличествоОшибок > 5 Тогда
				ОписаниеОшибки = "... " + СтрокаСЧислом(";%1 ошибка;; %1 ошибки; %1 ошибок; %1 ошибки", (КоличествоОшибок - НомерОшибки), ВидЧисловогоЗначения.Количественное, "L=ru");

				ТекстВсехОшибок = ТекстВсехОшибок + Разделитель + ОписаниеОшибки;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		ТекстВсехОшибок = ТекстВсехОшибок + ?(ДобавитьУточнениеОшибкиПараметровРаботыПрограммыДляРазработчика, БазоваяПодсистемаСервер.СП_УточнениеОшибкиПараметровРаботыПрограммыДляРазработчика(), "");

		ВызватьИсключение ЗаголовокОшибки + Разделитель + ТекстВсехОшибок;
	КонецЕсли;

	Возврат Результат;
КонецФункции

Функция ИдентификаторыИзКлючей()
	Запрос			= Новый Запрос;
	Запрос.Текст	=
	"ВЫБРАТЬ
	|	Идентификаторы.Ссылка КАК Ссылка,
	|	Идентификаторы.КлючОбъектаМетаданных КАК ХранилищеКлюча
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК Идентификаторы";

	Выборка = Запрос.Выполнить().Выбрать();

	ИдентификаторыИзКлючей = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		Если ТипЗнч(Выборка.ХранилищеКлюча) <> Тип("ХранилищеЗначения") Тогда
			Продолжить;
		КонецЕсли;
		КлючОбъектаМетаданных = Выборка.ХранилищеКлюча.Получить();

		Если КлючОбъектаМетаданных = Неопределено
		 Или КлючОбъектаМетаданных = Тип("Неопределено") Тогда
			Продолжить;
		КонецЕсли;

		ОбъектМетаданных = ОбъектМетаданныхПоКлючу(КлючОбъектаМетаданных);
		Если ОбъектМетаданных = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
		Если ИдентификаторыИзКлючей.Получить(ПолноеИмя) <> Неопределено Тогда
			ВызватьИсключение "Версия программы обновлена, требуется перезапустить сеанс.";
		КонецЕсли;

		ИдентификаторыИзКлючей.Вставить(ПолноеИмя, Выборка.Ссылка);
	КонецЦикла;

	Возврат ИдентификаторыИзКлючей;
КонецФункции

Функция ОбъектыМетаданныхПоИдентификаторамСПопыткойПовтора(Идентификаторы, ВызыватьИсключение)
	Если Идентификаторы.Количество() = 0 Тогда
		Возврат Новый Соответствие;
	КонецЕсли;

	ИдентификаторыКонфигурации = Новый Массив;
	ИдентификаторыРасширений   = Новый Массив;

	ДобавленныеИдентификаторыКонфигурации	= Новый Соответствие;
	ДобавленныеИдентификаторыРасширений		= Новый Соответствие;

	Обработанные							= Новый Соответствие;

	Для Каждого ТекущийИдентификатор Из Идентификаторы Цикл
		Если ТипЗнч(ТекущийИдентификатор) = Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных") И ЗначениеЗаполнено(ТекущийИдентификатор) Тогда
			Если ДобавленныеИдентификаторыКонфигурации[ТекущийИдентификатор] = Неопределено Тогда
				ИдентификаторыКонфигурации.Добавить(ТекущийИдентификатор);
				ДобавленныеИдентификаторыКонфигурации.Вставить(ТекущийИдентификатор, Истина);
			КонецЕсли;
		ИначеЕсли ТипЗнч(ТекущийИдентификатор) = Тип("СправочникСсылка.ИдентификаторыОбъектовРасширений") И ЗначениеЗаполнено(ТекущийИдентификатор) Тогда
			Если ДобавленныеИдентификаторыРасширений[ТекущийИдентификатор] = Неопределено Тогда
				ИдентификаторыРасширений.Добавить(ТекущийИдентификатор);
				ДобавленныеИдентификаторыРасширений.Вставить(ТекущийИдентификатор, Истина);
			КонецЕсли;
		ИначеЕсли ВызыватьИсключение Тогда
			Если ТипЗнч(ТекущийИдентификатор) = Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных")
			 Или ТипЗнч(ТекущийИдентификатор) = Тип("СправочникСсылка.ИдентификаторыОбъектовРасширений") Тогда
				ТекстОшибки = СтрШаблон(
					"Ошибка при выполнении функции БазоваяПодсистемаСервер.ОН_ОбъектМетаданныхПоИдентификатору().
					           |
					           |Неверный идентификатор: пустая ссылка типа ""%1"".",
					ТипЗнч(ТекущийИдентификатор));
			Иначе
				ТекстОшибки = СтрШаблон(
					"Ошибка при выполнении функции БазоваяПодсистемаСервер.ОН_ОбъектМетаданныхПоИдентификатору().
					           |
					           |Неверный тип идентификатора объекта метаданных:
					           |""%1"".",
					ТипЗнч(ТекущийИдентификатор));
			КонецЕсли;

			ВызватьИсключение ТекстОшибки;
		Иначе
			Обработанные.Вставить(ТекущийИдентификатор, Null);
		КонецЕсли;
	КонецЦикла;

	Если ИдентификаторыКонфигурации.Количество() > 0 Тогда
		БазоваяПодсистемаСерверПовтИсп.СП_ИдентификаторыОбъектовМетаданныхПроверкаИспользования(Истина, Ложь);
	КонецЕсли;

	Если ИдентификаторыРасширений.Количество() > 0 Тогда
		БазоваяПодсистемаСерверПовтИсп.СП_ИдентификаторыОбъектовМетаданныхПроверкаИспользования(Истина, Истина);
	КонецЕсли;

	Если ИдентификаторыКонфигурации.Количество() > 0 Или ИдентификаторыРасширений.Количество() > 0 Тогда
		Попытка
			ОбъектыМетаданных = ОбъектыМетаданныхПоИдентификаторамБезПопыткиПовтора(Идентификаторы, ИдентификаторыКонфигурации, ИдентификаторыРасширений, ВызыватьИсключение);
		Исключение
			ОбъектыМетаданных = Неопределено;
		КонецПопытки;
	Иначе
		ОбъектыМетаданных = Новый Соответствие;
	КонецЕсли;

	Если ОбъектыМетаданных = Неопределено Тогда
		ОбновитьДанныеСправочника();
		ОбъектыМетаданных = ОбъектыМетаданныхПоИдентификаторамБезПопыткиПовтора(Идентификаторы, ИдентификаторыКонфигурации, ИдентификаторыРасширений, ВызыватьИсключение);
	КонецЕсли;

	Для Каждого КлючИЗначение Из Обработанные Цикл
		ОбъектыМетаданных.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;

	Возврат ОбъектыМетаданных;
КонецФункции

Функция ОбъектыМетаданныхПоИдентификаторамБезПопыткиПовтора(Идентификаторы, ИдентификаторыКонфигурации, ИдентификаторыРасширений, ВызыватьИсключение)
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;

	Если ИдентификаторыКонфигурации.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("ИдентификаторыКонфигурации", ИдентификаторыКонфигурации);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Идентификаторы.Ссылка КАК Ссылка,
		|	Идентификаторы.КлючОбъектаМетаданных КАК КлючОбъектаМетаданных,
		|	Идентификаторы.ПолноеИмя КАК ПолноеИмя,
		|	Идентификаторы.Наименование КАК Представление,
		|	Идентификаторы.ПолноеИмя КАК ПолноеИмяКоллекции,
		|	Идентификаторы.ПометкаУдаления КАК ПометкаУдаления,
		|	ЛОЖЬ КАК ОбъектРасширений,
		|	"""" КАК ИмяРасширения
		|ИЗ
		|	Справочник.ИдентификаторыОбъектовМетаданных КАК Идентификаторы
		|ГДЕ
		|	Идентификаторы.Ссылка В(&ИдентификаторыКонфигурации)";
	КонецЕсли;

	Если ИдентификаторыРасширений.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("ИдентификаторыРасширений", ИдентификаторыРасширений);
		Запрос.УстановитьПараметр("ВерсияРасширений", ПараметрыСеанса.ВерсияРасширений);
		Если ЗначениеЗаполнено(Запрос.Текст) Тогда
			Запрос.Текст = Запрос.Текст +
			"
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	Идентификаторы.Ссылка КАК Ссылка,
		|	Идентификаторы.КлючОбъектаМетаданных КАК КлючОбъектаМетаданных,
		|	ЕСТЬNULL(ВерсииИдентификаторов.ПолноеИмяОбъекта, """") КАК ПолноеИмя,
		|	Идентификаторы.Наименование КАК Представление,
		|	Идентификаторы.ПолноеИмя КАК ПолноеИмяКоллекции,
		|	Идентификаторы.ПометкаУдаления КАК ПометкаУдаления,
		|	ИСТИНА КАК ОбъектРасширений,
		|	Идентификаторы.ИмяРасширения КАК ИмяРасширения
		|ИЗ
		|	Справочник.ИдентификаторыОбъектовРасширений КАК Идентификаторы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыОбъектовВерсийРасширений КАК ВерсииИдентификаторов
		|		ПО (ВерсииИдентификаторов.Идентификатор = Идентификаторы.Ссылка)
		|			И (ВерсииИдентификаторов.ВерсияРасширений = &ВерсияРасширений)
		|ГДЕ
		|	Идентификаторы.Ссылка В(&ИдентификаторыРасширений)";
	КонецЕсли;

	Выгрузка = Запрос.Выполнить().Выгрузить();
	ЗаголовокОшибки = "Ошибка при выполнении функции ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору().";

	ОбъектыМетаданныхИдентификаторов = Новый Соответствие;

	ВсегоИдентификаторов = ИдентификаторыКонфигурации.Количество() + ИдентификаторыРасширений.Количество();
	Если Выгрузка.Количество() < ВсегоИдентификаторов Тогда
		Для Каждого Идентификатор Из Идентификаторы Цикл
			Если Выгрузка.Найти(Идентификатор, "Ссылка") = Неопределено Тогда
				Если ВызыватьИсключение Тогда
					Прервать;
				Иначе
					// Объект метаданных не существует.
					ОбъектыМетаданныхИдентификаторов.Вставить(Идентификатор, Null);

					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если ВызыватьИсключение Тогда
			Если ИдентификаторыРасширений.Найти(Идентификатор) = Неопределено Тогда
				ТекстОшибки = СтрШаблон(
					"Идентификатор объекта метаданных ""%1""
					           |был удален из информационной базы после того, как был помечен на удаление
					           |в связи с тем, что объект был удален из новой версии конфигурации.
					           |
					           |Все настройки, сделанные для объекта до его удаления
					           |более недоступны, их следует удалить. Если позже объект
					           |был вновь добавлен, тогда настройки следует сделать заново.",
					Строка(Идентификатор));
			Иначе
				ТекстОшибки = СтрШаблон(
					"Идентификатор объекта расширений ""%1""
					           |был удален из информационной базы после того, как был помечен на удаление
					           |в связи с тем, что было удалено расширение конфигурации с этим объектом
					           |или объект был удален из новой версии расширения конфигурации.
					           |
					           |Все настройки, сделанные для объекта до его удаления
					           |более недоступны, их следует удалить. Если позже объект
					           |был вновь добавлен, тогда настройки следует сделать заново.",
					Строка(Идентификатор));
			КонецЕсли;

			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	КонецЕсли;

	КонфигурацияБазыДанныхИзмененаДинамически = КонфигурацияБазыДанныхИзмененаДинамически();

	// Проверка соответствия ключа объекта метаданных полному имени объекта метаданных.
	Для Каждого Свойства Из Выгрузка Цикл
		РезультатПроверки = КлючОбъектаМетаданныхСоответствуетПолномуИмени(Свойства);
		Если РезультатПроверки.НеСоответствует Тогда
			Если РезультатПроверки.ОбъектМетаданных = Неопределено Тогда
				Если ЗначениеЗаполнено(РезультатПроверки.ПредставлениеУдаленного) Тогда
					ПредставлениеИдентификатора = РезультатПроверки.ПредставлениеУдаленного;
				Иначе
					ПредставлениеИдентификатора = Свойства.Представление;
				КонецЕсли;

				Если Свойства.ОбъектРасширений Тогда
					ОбъектРасширенияНеСуществует	= Не Свойства.ПометкаУдаления;
					ИмяРасширения					= ?(СтрНачинаетсяС(Свойства.ИмяРасширения, "? "), Сред(Свойства.ИмяРасширения, 3), Свойства.ИмяРасширения);
					Отбор = Новый Структура("Имя", ИмяРасширения);
					УстановленныеРасширения = РасширенияКонфигурации.Получить(Отбор, ИсточникРасширенийКонфигурации.БазаДанных);
					ОтключенныеРасширения   = РасширенияКонфигурации.Получить(Отбор, ИсточникРасширенийКонфигурации.СеансОтключенные);
					АктивныеРасширения      = РасширенияКонфигурации.Получить(Отбор, ИсточникРасширенийКонфигурации.СеансАктивные);

					Если УстановленныеРасширения.Количество() = 0 Тогда
						ОбъектРасширенияНеСуществует = Истина;
						ТекстОшибки = Стршаблон(
							"Расширение конфигурации ""%1"" удалено.
							           |Объект ""%2"" не существует.
							           |Все настройки, сделанные для расширения до его удаления, более недоступны.
							           |Следует выполнить настройки заново с учетом изменений.",
							ИмяРасширения,
							ПредставлениеИдентификатора);
					ИначеЕсли Не УстановленныеРасширения[0].Активно Тогда
						ТекстОшибки = СтрШаблон(
							"Расширение конфигурации ""%1"" установлено, но выключено.
							           |Требуется включить расширение и перезапустить сеанс.",
							ИмяРасширения);
					ИначеЕсли ОтключенныеРасширения.Количество() > 0 И Не ОтключенныеРасширения[0].Активно
					      Или ОтключенныеРасширения.Количество() = 0 И АктивныеРасширения.Количество() = 0 Тогда

						ТекстОшибки = СтрШаблон(
							"Расширение конфигурации ""%1"" установлено после запуска сеанса, поэтому не подключено.
							           |Требуется перезапустить сеанс.",
							ИмяРасширения);
					ИначеЕсли ОтключенныеРасширения.Количество() > 0 И ОтключенныеРасширения[0].Активно Тогда
						ТекстОшибки = СтрШаблон(
							"Расширение конфигурации ""%1"" установлено, но отключено при запуске сеанса.
							           |Это значит, что при его подключении возникла ошибка.",
							ИмяРасширения);
					Иначе // АктивныеРасширения.Количество() > 0
						ОбъектРасширенияНеСуществует = Истина;

						Если РезультатПроверки.ОбъектМетаданныхУдаленного <> Неопределено
						   И РезультатПроверки.ОбъектМетаданныхУдаленного.РасширениеКонфигурации() <> Неопределено
						   И РезультатПроверки.ОбъектМетаданныхУдаленного.РасширениеКонфигурации().Имя = АктивныеРасширения[0].Имя Тогда

							ТекстОшибки = СтрШаблон(
								"Расширение конфигурации ""%1"" установлено и подключено,
								           |но объект ""%2""
								           |не может быть получен по идентификатору помеченному на удаление.
								           |Обычно это значит, что расширение было удалено и установлено заново вместо обновления,
								           |поэтому все настройки, сделанные для расширения до его удаления,
								           |более недоступны и их следует сделать заново.",
								ИмяРасширения,
								ПредставлениеИдентификатора);
						Иначе
							ТекстОшибки = СтрШаблон(
								"Расширение конфигурации ""%1"" установлено и подключено,
								           |но объект ""%2"" не существует.
								           |Это значит, что объект был удален в новой версии расширения.
								           |Объект и все настройки, сделанные до его удаления, более недоступны.
								           |Следует выполнить настройки заново с учетом изменений.",
								ИмяРасширения,
								ПредставлениеИдентификатора);
						КонецЕсли;
					КонецЕсли;

					Если ВызыватьИсключение Тогда
						ВызватьИсключение ТекстОшибки;
					ИначеЕсли ОбъектРасширенияНеСуществует Тогда
						ОбъектыМетаданныхИдентификаторов.Вставить(Свойства.Ссылка, Null);
					Иначе
						ОбъектыМетаданныхИдентификаторов.Вставить(Свойства.Ссылка, Неопределено);
						Продолжить;
					КонецЕсли;
				ИначеЕсли КонфигурацияБазыДанныхИзмененаДинамически Тогда
					// Возможно объект метаданных будет доступен после перезапуска.
					Если ВызыватьИсключение Тогда
						// Стандартное исключение по причине динамического обновления.
						ВызватьИсключение "Версия программы обновлена, требуется перезапустить сеанс.";
					Иначе
						ОбъектыМетаданныхИдентификаторов.Вставить(Свойства.Ссылка, Неопределено);

						Продолжить;
					КонецЕсли;
				ИначеЕсли Не ВызыватьИсключение Тогда
					// Объект метаданных не существует.
					ОбъектыМетаданныхИдентификаторов.Вставить(Свойства.Ссылка, Null);

					Продолжить;
				ИначеЕсли РезультатПроверки.ОбъектМетаданныхУдаленного <> Неопределено
				        И РезультатПроверки.ОбъектМетаданныхУдаленного.РасширениеКонфигурации() = Неопределено Тогда

					ТекстОшибки = СтрШаблон(
						"Объект ""%1""
						           |не может быть получен по идентификатору помеченному на удаление.
						           |Это значит, что объект был удален из конфигурации, а позже снова добавлен.
						           |Поэтому все настройки, сделанные для объекта до его удаления
						           |более недоступны и их следует сделать заново.",
						ПредставлениеИдентификатора);

					ВызватьИсключение ТекстОшибки;
				Иначе
					ТекстОшибки = СтрШаблон(
						"Объект ""%1"" не существует.
						           |Это значит, что объект метаданных был удален в новой версии конфигурации.
						           |Объект и все настройки, сделанные до его удаления, более недоступны.
						           |Следует выполнить настройки заново с учетом изменений.",
						ПредставлениеИдентификатора);

					ВызватьИсключение ТекстОшибки;
				КонецЕсли;
			ИначеЕсли КонфигурацияБазыДанныхИзмененаДинамически Тогда
				// Возможно объект метаданных был переименован.
				ОписаниеОшибки = "";
			Иначе
				ОписаниеОшибки =  СтрШаблон(
					"Идентификатору ""%1""
					           |найденному в справочнике ""%2"",
					           |соответствует объект метаданных ""%3"",
					           |полное имя которого отличается от заданного в идентификаторе.",
					Свойства.Представление,
					НазваниеСправочника(Свойства.ОбъектРасширений),
					РезультатПроверки.ОбъектМетаданных.ПолноеИмя())
					+ БазоваяПодсистемаСервер.СП_УточнениеОшибкиПараметровРаботыПрограммыДляРазработчика();
			КонецЕсли;

			Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
				ВызватьИсключение ЗаголовокОшибки + Символы.ПС + Символы.ПС + ОписаниеОшибки;
			КонецЕсли;
		КонецЕсли;

		Если Не Свойства.ОбъектРасширений И Свойства.ПометкаУдаления И Не КонфигурацияБазыДанныхИзмененаДинамически Тогда
			ОписаниеОшибки = СтрШаблон(
				"Идентификатор ""%1""
				           |найден в справочнике ""%2"",
				           |но значение реквизита ""Пометка удаления"" установлено Истина.",
				Свойства.Представление,
				НазваниеСправочника(Свойства.ОбъектРасширений));

			ВызватьИсключение ЗаголовокОшибки + Символы.ПС + Символы.ПС + ОписаниеОшибки + БазоваяПодсистемаСервер.СП_УточнениеОшибкиПараметровРаботыПрограммыДляРазработчика();
		КонецЕсли;

		ОписаниеОбъектаМетаданных = Новый Структура("Объект, Ключ", РезультатПроверки.ОбъектМетаданных);
		Если РезультатПроверки.КлючОбъектаМетаданных <> Неопределено Тогда
			ОписаниеОбъектаМетаданных.Ключ = РезультатПроверки.КлючОбъектаМетаданных;
		Иначе
			ОписаниеОбъектаМетаданных.Ключ = Свойства.ПолноеИмя;
		КонецЕсли;
		ОбъектыМетаданныхИдентификаторов.Вставить(Свойства.Ссылка, ОписаниеОбъектаМетаданных);
	КонецЦикла;

	Возврат ОбъектыМетаданныхИдентификаторов;
КонецФункции

Функция КэшИдентификаторов()
	КлючДанныхПовторногоИспользования = Строка(ПараметрыСеанса.КлючДанныхПовторногоИспользования);

	Возврат БазоваяПодсистемаСерверПовтИсп.СП_КэшИдентификаторовОбъектовМетаданных(КлючДанныхПовторногоИспользования);
КонецФункции

Функция КэшИдентификаторовОбъектовМетаданных(КлючДанныхПовторногоИспользования) Экспорт
	Хранилище = Новый Структура;
	Хранилище.Вставить("ИдентификаторыПоПолнымИменам",					Новый Соответствие);
	Хранилище.Вставить("ОписаниеОбъектовМетаданныхПоИдентификаторам",	Новый Соответствие);

	Возврат Новый ФиксированнаяСтруктура(Хранилище);
КонецФункции

Процедура ЗаменитьДублиПодчиненногоУзлаНайденныеПриЗагрузке(ТолькоПроверка, ЕстьИзменения)
	Если НЕ БазоваяПодсистемаСервер.ОН_ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;

	// Замена дублей в подчиненном РИБ-узле.
	Запрос			= Новый Запрос;
	Запрос.Текст	=
	"ВЫБРАТЬ
	|	Идентификаторы.Ссылка,
	|	Идентификаторы.НоваяСсылка
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК Идентификаторы
	|ГДЕ
	|	Идентификаторы.НоваяСсылка <> ЗНАЧЕНИЕ(Справочник.ИдентификаторыОбъектовМетаданных.ПустаяСсылка)";

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	Если ТолькоПроверка Тогда
		ЕстьИзменения = Истина;

		Возврат;
	КонецЕсли;

	Выборка				= РезультатЗапроса.Выбрать();
	ЗаменяемыеСсылки	= Новый Массив;
	СтарыеИНовыеСсылки	= Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		ЗаменяемыеСсылки.Добавить(Выборка.Ссылка);
		СтарыеИНовыеСсылки.Вставить(Выборка.Ссылка, Выборка.НоваяСсылка);
	КонецЦикла;

	ТекущаяПопытка = 1;
	Пока Истина Цикл
		НайденныеДанные = НайтиПоСсылкам(ЗаменяемыеСсылки);
		НайденныеДанные.Колонки[0].Имя = "Ссылка";
		НайденныеДанные.Колонки[1].Имя = "Данные";
		НайденныеДанные.Колонки[2].Имя = "Метаданные";
		НайденныеДанные.Колонки.Добавить("Включено");
		НайденныеДанные.ЗаполнитьЗначения(Истина, "Включено");

		Если НайденныеДанные.Количество() = 0 Тогда
			Блокировка			= Новый БлокировкаДанных;
			ЭлементБлокировки	= Блокировка.Добавить("Справочник.ИдентификаторыОбъектовМетаданных");
			Для Каждого ЗаменяемаяСсылка Из ЗаменяемыеСсылки Цикл
				ЭлементБлокировки.УстановитьЗначение("Ссылка", ЗаменяемаяСсылка);
			КонецЦикла;
			НачатьТранзакцию();
			Попытка
				Блокировка.Заблокировать();
				// Очистка новых ссылок у дублей идентификаторов.
				Для Каждого ЗаменяемаяСсылка Из ЗаменяемыеСсылки Цикл
					ОбъектДубля							= ЗаменяемаяСсылка.ПолучитьОбъект();
					ОбъектДубля.НоваяСсылка				= Неопределено;
					ОбъектДубля.ОбменДанными.Загрузка	= Истина;
					ОбъектДубля.Записать();
				КонецЦикла;
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				ВызватьИсключение;
			КонецПопытки;
			Прервать;
		КонецЕсли;

		Если ТекущаяПопытка > 10 Тогда
			ВызватьИсключение "Не удалось выполнить замену дублей идентификаторов объектов метаданных.
				           |После 10 попыток все еще имеются данные, которые требуют замены.
				           |Выполните действие в монопольном режиме.";
		КонецЕсли;

		БезОшибок = ВыполнитьЗаменуЭлементов(СтарыеИНовыеСсылки, НайденныеДанные, Истина);
		Если Не БезОшибок Тогда
			ВызватьИсключение "Не удалось выполнить замену дублей идентификаторов объектов метаданных.
				           |Подробнее см. ошибки при замене идентификатора в журнале регистрации.";
		КонецЕсли;
		ТекущаяПопытка = ТекущаяПопытка + 1;
	КонецЦикла;
КонецПроцедуры

Функция ВыполнитьЗаменуЭлементов(Знач Заменяемые, Знач ТаблицаСсылок, Знач ОтключатьКонтрольЗаписи = Ложь, Знач ОбъектыРасширений = Ложь)
	Параметры = ПараметрыЗаменыЭлементов();

	Для Каждого РегистрБухгалтерии Из Метаданные.РегистрыБухгалтерии Цикл
		Параметры.Вставить(РегистрБухгалтерии.Имя + "Субконто",        РегистрБухгалтерии.ПланСчетов.МаксКоличествоСубконто);
		Параметры.Вставить(РегистрБухгалтерии.Имя + "Корреспонденция", РегистрБухгалтерии.Корреспонденция);
	КонецЦикла;

	ОбрабатываемаяСсылка	= Неопределено;
	БылиИсключения			= Ложь;

	Попытка
		Для Каждого СтрокаТаблицы Из ТаблицаСсылок Цикл
			Если Не СтрокаТаблицы.Включено Тогда
				Продолжить;
			КонецЕсли;
			ПравильныйЭлемент	= Заменяемые[СтрокаТаблицы.Ссылка];

			Ссылка				= СтрокаТаблицы.Ссылка;

			Если ОбрабатываемаяСсылка <> СтрокаТаблицы.Данные Тогда
				Если ОбрабатываемаяСсылка <> Неопределено И Параметры.Объект <> Неопределено Тогда
					Попытка
						Параметры.Объект.ОбменДанными.Загрузка = Истина;
						Если ОтключатьКонтрольЗаписи Тогда
							Параметры.Объект.ДополнительныеСвойства.Вставить("ПропуститьЗаписьВерсииОбъекта");
							ОбновлениеВерсииИБСервер.ОИБ_ЗаписатьДанные(Параметры.Объект, Ложь);
						Иначе
							Параметры.Объект.Записать();
						КонецЕсли;
					Исключение
						БылиИсключения		= Истина;
						ИнформацияОбОшибке	= ИнформацияОбОшибке();
						ТекстОшибки			= СтрШаблон("При записи объекта ""%1"" возникла ошибка:
							           |%2",
							ПолучитьНавигационнуюСсылку(Параметры.Объект.Ссылка),
							ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
						Если ТранзакцияАктивна() Тогда
							ВызватьИсключение ТекстОшибки;
						КонецЕсли;
						СообщитьОбОшибке(ТекстОшибки, ОбъектыРасширений);
					КонецПопытки;
					Параметры.Объект = Неопределено;
				КонецЕсли;
				ОбрабатываемаяСсылка = СтрокаТаблицы.Данные;
			КонецЕсли;

			Если Метаданные.Документы.Содержит(СтрокаТаблицы.Метаданные) Тогда
				Если Параметры.Объект = Неопределено Тогда
					Параметры.Объект = СтрокаТаблицы.Данные.ПолучитьОбъект();
				КонецЕсли;

				Для Каждого Реквизит Из СтрокаТаблицы.Метаданные.Реквизиты Цикл
					Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) И Параметры.Объект[Реквизит.Имя] = Ссылка Тогда
						Параметры.Объект[Реквизит.Имя] = ПравильныйЭлемент;
					КонецЕсли;
				КонецЦикла;

				Для Каждого ТабличнаяЧасть Из СтрокаТаблицы.Метаданные.ТабличныеЧасти Цикл
					Для Каждого Реквизит Из ТабличнаяЧасть.Реквизиты Цикл
						Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) Тогда
							СтрокаТабличнойЧасти = Параметры.Объект[ТабличнаяЧасть.Имя].Найти(Ссылка, Реквизит.Имя);
							Пока СтрокаТабличнойЧасти <> Неопределено Цикл
								СтрокаТабличнойЧасти[Реквизит.Имя]	= ПравильныйЭлемент;
								СтрокаТабличнойЧасти				= Параметры.Объект[ТабличнаяЧасть.Имя].Найти(Ссылка, Реквизит.Имя);
							КонецЦикла;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;

				Для Каждого Движение Из СтрокаТаблицы.Метаданные.Движения Цикл
					ЭтоДвижениеРегистраБухгалтерии	= Метаданные.РегистрыБухгалтерии.Содержит(Движение);
					ЕстьКорреспонденция				= ЭтоДвижениеРегистраБухгалтерии И Параметры[Движение.Имя + "Корреспонденция"];

					НаборЗаписей	= Параметры.Объект.Движения[Движение.Имя];
					НаборЗаписей.Прочитать();
					НадоЗаписывать	= Ложь;
					ТаблицаНабора	= НаборЗаписей.Выгрузить();

					Если ТаблицаНабора.Количество() = 0 Тогда
						Продолжить;
					КонецЕсли;

					ИменаКолонок = Новый Массив;

					// Получим имена измерений, которые могут содержать ссылку.
					Для Каждого Измерение Из Движение.Измерения Цикл
						Если Измерение.Тип.СодержитТип(ТипЗнч(Ссылка)) Тогда
							Если ЭтоДвижениеРегистраБухгалтерии Тогда
								Если Измерение.ПризнакУчета <> Неопределено Тогда
									ИменаКолонок.Добавить(Измерение.Имя + "Дт");
									ИменаКолонок.Добавить(Измерение.Имя + "Кт");
								Иначе
									ИменаКолонок.Добавить(Измерение.Имя);
								КонецЕсли;
							Иначе
								ИменаКолонок.Добавить(Измерение.Имя);
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;

					// Получим имена ресурсов, которые могут содержать ссылку.
					Если Метаданные.РегистрыСведений.Содержит(Движение) Тогда
						Для Каждого Ресурс Из Движение.Ресурсы Цикл
							Если Ресурс.Тип.СодержитТип(ТипЗнч(Ссылка)) Тогда
								ИменаКолонок.Добавить(Ресурс.Имя);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;

					// Получим имена ресурсов, которые могут содержать ссылку.
					Для Каждого Реквизит Из Движение.Реквизиты Цикл
						Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) Тогда
							ИменаКолонок.Добавить(Реквизит.Имя);
						КонецЕсли;
					КонецЦикла;

					// Произведем замены в таблице.
					Для Каждого ИмяКолонки Из ИменаКолонок Цикл
						СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, ИмяКолонки);
						Пока СтрокаТабЧасти <> Неопределено Цикл
							СтрокаТабЧасти[ИмяКолонки]	= ПравильныйЭлемент;
							НадоЗаписывать				= Истина;
							СтрокаТабЧасти				= ТаблицаНабора.Найти(Ссылка, ИмяКолонки);
						КонецЦикла;
					КонецЦикла;

					Если Метаданные.РегистрыБухгалтерии.Содержит(Движение) Тогда
						Для ИндексСубконто = 1 По Параметры[Движение.Имя + "Субконто"] Цикл
							Если ЕстьКорреспонденция Тогда
								СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, "СубконтоДт"+ИндексСубконто);
								Пока СтрокаТабЧасти <> Неопределено Цикл
									СтрокаТабЧасти["СубконтоДт"+ИндексСубконто]	= ПравильныйЭлемент;
									НадоЗаписывать								= Истина;
									СтрокаТабЧасти								= ТаблицаНабора.Найти(Ссылка, "СубконтоДт"+ИндексСубконто);
								КонецЦикла;
								СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, "СубконтоКт"+ИндексСубконто);
								Пока СтрокаТабЧасти <> Неопределено Цикл
									СтрокаТабЧасти["СубконтоКт"+ИндексСубконто]	= ПравильныйЭлемент;
									НадоЗаписывать								= Истина;
									СтрокаТабЧасти								= ТаблицаНабора.Найти(Ссылка, "СубконтоКт"+ИндексСубконто);
								КонецЦикла;
							Иначе
								СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, "Субконто"+ИндексСубконто);
								Пока СтрокаТабЧасти <> Неопределено Цикл
									СтрокаТабЧасти["Субконто"+ИндексСубконто]	= ПравильныйЭлемент;
									НадоЗаписывать								= Истина;
									СтрокаТабЧасти								= ТаблицаНабора.Найти(Ссылка, "Субконто"+ИндексСубконто);
								КонецЦикла;
							КонецЕсли;
						КонецЦикла;

						Если Ссылка.Метаданные() = Движение.ПланСчетов Тогда
							Для Каждого СтрокаТабЧасти Из ТаблицаНабора Цикл
								Если ЕстьКорреспонденция Тогда
									Если СтрокаТабЧасти.СчетДт = Ссылка Тогда
										СтрокаТабЧасти.СчетДт	= ПравильныйЭлемент;
										НадоЗаписывать			= Истина;
									КонецЕсли;
									Если СтрокаТабЧасти.СчетКт = Ссылка Тогда
										СтрокаТабЧасти.СчетКт	= ПравильныйЭлемент;
										НадоЗаписывать			= Истина;
									КонецЕсли;
								Иначе
									Если СтрокаТабЧасти.Счет = Ссылка Тогда
										СтрокаТабЧасти.Счет		= ПравильныйЭлемент;
										НадоЗаписывать			= Истина;
									КонецЕсли;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;

					Если Метаданные.РегистрыРасчета.Содержит(Движение) Тогда
						СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, "ВидРасчета");
						Пока СтрокаТабЧасти <> Неопределено Цикл
							СтрокаТабЧасти["ВидРасчета"]	= ПравильныйЭлемент;
							НадоЗаписывать					= Истина;
							СтрокаТабЧасти					= ТаблицаНабора.Найти(Ссылка, "ВидРасчета");
						КонецЦикла;
					КонецЕсли;

					Если НадоЗаписывать Тогда
						НаборЗаписей.Загрузить(ТаблицаНабора);
						Попытка
							Если ОтключатьКонтрольЗаписи Тогда
								НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьЗаписьВерсииОбъекта");
								ОбновлениеВерсииИБСервер.ОИБ_ЗаписатьДанные(НаборЗаписей, Ложь);
							Иначе
								НаборЗаписей.Записать();
							КонецЕсли;
						Исключение
							БылиИсключения = Истина;
							ИнформацияОбОшибке = ИнформацияОбОшибке();
							ТекстОшибки = СтрШаблон("При записи движений объекта ""%1"" в ""%2"" возникла ошибка:
								           |%3",
								ПолучитьНавигационнуюСсылку(Параметры.Объект.Ссылка),
								НаборЗаписей.Метаданные().ПолноеИмя(),
								ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
							Если ТранзакцияАктивна() Тогда
								ВызватьИсключение ТекстОшибки;
							КонецЕсли;
							СообщитьОбОшибке(ТекстОшибки, ОбъектыРасширений);
						КонецПопытки;
					КонецЕсли;
				КонецЦикла;

				Для Каждого Последовательность Из Метаданные.Последовательности Цикл
					Если Последовательность.Документы.Содержит(СтрокаТаблицы.Метаданные) Тогда
						НадоЗаписывать	= Ложь;
						НаборЗаписи		= Последовательности[Последовательность.Имя].СоздатьНаборЗаписей();
						НаборЗаписи.Отбор.Регистратор.Установить(СтрокаТаблицы.Данные);
						НаборЗаписи.Прочитать();

						Если НаборЗаписи.Количество() > 0 Тогда
							Для Каждого Измерение Из Последовательность.Измерения Цикл
								Если Измерение.Тип.СодержитТип(ТипЗнч(Ссылка)) И НаборЗаписи[0][Измерение.Имя]=Ссылка Тогда
									НаборЗаписи[0][Измерение.Имя]	= ПравильныйЭлемент;
									НадоЗаписывать					= Истина;
								КонецЕсли;
							КонецЦикла;
							Если НадоЗаписывать Тогда
								Попытка
									Если ОтключатьКонтрольЗаписи Тогда
										НаборЗаписи.ДополнительныеСвойства.Вставить("ПропуститьЗаписьВерсииОбъекта");
										ОбновлениеВерсииИБСервер.ОИБ_ЗаписатьДанные(НаборЗаписи, Ложь);
									Иначе
										НаборЗаписи.Записать();
									КонецЕсли;
								Исключение
									БылиИсключения = Истина;
									ИнформацияОбОшибке = ИнформацияОбОшибке();
									ТекстОшибки = СтрШаблон("При записи по регистратору ""%1"" в ""%2"" возникла ошибка:
											           |%3",
											ПолучитьНавигационнуюСсылку(СтрокаТаблицы.Данные),
											НаборЗаписи.Метаданные().ПолноеИмя(),
											ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
									Если ТранзакцияАктивна() Тогда
										ВызватьИсключение ТекстОшибки;
									КонецЕсли;
									СообщитьОбОшибке(ТекстОшибки, ОбъектыРасширений);
								КонецПопытки;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли Метаданные.Справочники.Содержит(СтрокаТаблицы.Метаданные) Тогда
				Если Параметры.Объект = Неопределено Тогда
					Параметры.Объект = СтрокаТаблицы.Данные.ПолучитьОбъект();
				КонецЕсли;

				Если СтрокаТаблицы.Метаданные.Владельцы.Содержит(Ссылка.Метаданные()) И Параметры.Объект.Владелец = Ссылка Тогда
					Параметры.Объект.Владелец = ПравильныйЭлемент;
				КонецЕсли;

				Если СтрокаТаблицы.Метаданные.Иерархический И Параметры.Объект.Родитель = Ссылка Тогда
					Параметры.Объект.Родитель = ПравильныйЭлемент;
				КонецЕсли;

				Для Каждого Реквизит Из СтрокаТаблицы.Метаданные.Реквизиты Цикл
					Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) И Параметры.Объект[Реквизит.Имя] = Ссылка Тогда
						Параметры.Объект[Реквизит.Имя] = ПравильныйЭлемент;
					КонецЕсли;
				КонецЦикла;

				Для Каждого ТЧ Из СтрокаТаблицы.Метаданные.ТабличныеЧасти Цикл
					Для Каждого Реквизит Из ТЧ.Реквизиты Цикл
						Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) Тогда
							СтрокаТабЧасти = Параметры.Объект[ТЧ.Имя].Найти(Ссылка, Реквизит.Имя);
							Пока СтрокаТабЧасти <> Неопределено Цикл
								СтрокаТабЧасти[Реквизит.Имя]	= ПравильныйЭлемент;
								СтрокаТабЧасти					= Параметры.Объект[ТЧ.Имя].Найти(Ссылка, Реквизит.Имя);
							КонецЦикла;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			ИначеЕсли Метаданные.ПланыВидовХарактеристик.Содержит(СтрокаТаблицы.Метаданные)
			      ИЛИ Метаданные.ПланыСчетов.Содержит            (СтрокаТаблицы.Метаданные)
			      ИЛИ Метаданные.ПланыВидовРасчета.Содержит      (СтрокаТаблицы.Метаданные)
			      ИЛИ Метаданные.Задачи.Содержит                 (СтрокаТаблицы.Метаданные)
			      ИЛИ Метаданные.БизнесПроцессы.Содержит         (СтрокаТаблицы.Метаданные) Тогда

				Если Параметры.Объект = Неопределено Тогда
					Параметры.Объект = СтрокаТаблицы.Данные.ПолучитьОбъект();
				КонецЕсли;

				Для Каждого Реквизит Из СтрокаТаблицы.Метаданные.Реквизиты Цикл
					Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) И Параметры.Объект[Реквизит.Имя] = Ссылка Тогда
						Параметры.Объект[Реквизит.Имя] = ПравильныйЭлемент;
					КонецЕсли;
				КонецЦикла;

				Для Каждого ТЧ Из СтрокаТаблицы.Метаданные.ТабличныеЧасти Цикл
					Для Каждого Реквизит Из ТЧ.Реквизиты Цикл
						Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) Тогда
							СтрокаТабЧасти = Параметры.Объект[ТЧ.Имя].Найти(Ссылка, Реквизит.Имя);
							Пока СтрокаТабЧасти <> Неопределено Цикл
								СтрокаТабЧасти[Реквизит.Имя]	= ПравильныйЭлемент;
								СтрокаТабЧасти					= Параметры.Объект[ТЧ.Имя].Найти(Ссылка, Реквизит.Имя);
							КонецЦикла;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			ИначеЕсли Метаданные.Константы.Содержит(СтрокаТаблицы.Метаданные) Тогда
				БазоваяПодсистемаСервер.ОН_МенеджерОбъектаПоПолномуИмени(СтрокаТаблицы.Метаданные.ПолноеИмя()).Установить(ПравильныйЭлемент);
			ИначеЕсли Метаданные.РегистрыСведений.Содержит(СтрокаТаблицы.Метаданные) Тогда
				СтруктураИзмерений	= Новый Структура;
				МенеджерРегистра 	= БазоваяПодсистемаСервер.ОН_МенеджерОбъектаПоПолномуИмени(СтрокаТаблицы.Метаданные.ПолноеИмя());
				НаборЗаписей		= МенеджерРегистра.СоздатьНаборЗаписей();
				Для Каждого Измерение Из СтрокаТаблицы.Метаданные.Измерения Цикл
					НаборЗаписей.Отбор[Измерение.Имя].Установить(СтрокаТаблицы.Данные[Измерение.Имя]);
					СтруктураИзмерений.Вставить(Измерение.Имя, СтрокаТаблицы.Данные[Измерение.Имя]);
				КонецЦикла;
				Если СтрокаТаблицы.Метаданные.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
					НаборЗаписей.Отбор["Период"].Установить(СтрокаТаблицы.Данные.Период);
				КонецЕсли;
				НаборЗаписей.Прочитать();

				Если НаборЗаписей.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;

				ТаблицаНабора = НаборЗаписей.Выгрузить();
				НаборЗаписей.Очистить();

				ТекстОшибки = "";
				НачатьТранзакцию();
				Попытка
					Попытка
						Если ОтключатьКонтрольЗаписи Тогда
							НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьЗаписьВерсииОбъекта");
							ОбновлениеВерсииИБСервер.ОИБ_ЗаписатьДанные(НаборЗаписей, Ложь);
						Иначе
							НаборЗаписей.Записать();
						КонецЕсли;
					Исключение
						ИнформацияОбОшибке	= ИнформацияОбОшибке();
						ТекстОшибки			= СтрШаблон("При удалении записи ""%1"" возникла ошибка:
							           |%2",
							ПолучитьНавигационнуюСсылку(МенеджерРегистра.СоздатьКлючЗаписи(СтруктураИзмерений)),
							ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
						ВызватьИсключение;
					КонецПопытки;

					Для Каждого Колонка Из ТаблицаНабора.Колонки Цикл
						Если ТаблицаНабора[0][Колонка.Имя] = Ссылка Тогда
							ТаблицаНабора[0][Колонка.Имя] = ПравильныйЭлемент;
							Если СтруктураИзмерений.Свойство(Колонка.Имя) Тогда
								НаборЗаписей.Отбор[Колонка.Имя].Установить(ПравильныйЭлемент);
								СтруктураИзмерений[Колонка.Имя] = ПравильныйЭлемент;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;

					НаборЗаписей.Загрузить(ТаблицаНабора);

					Попытка
						Если ОтключатьКонтрольЗаписи Тогда
							НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьЗаписьВерсииОбъекта");
							ОбновлениеВерсииИБСервер.ОИБ_ЗаписатьДанные(НаборЗаписей, Ложь);
						Иначе
							НаборЗаписей.Записать();
						КонецЕсли;
					Исключение
						ИнформацияОбОшибке	= ИнформацияОбОшибке();
						ТекстОшибки			= СтрШаблон("При добавлении записи ""%1"" возникла ошибка:
							           |%2",
							ПолучитьНавигационнуюСсылку(МенеджерРегистра.СоздатьКлючЗаписи(СтруктураИзмерений)),
							ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
						ВызватьИсключение;
					КонецПопытки;

					ЗафиксироватьТранзакцию();
				Исключение
					ОтменитьТранзакцию();
					БылиИсключения = Истина;
					Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
						ВызватьИсключение;
					КонецЕсли;
					Если ТранзакцияАктивна() Тогда
						ВызватьИсключение ТекстОшибки;
					КонецЕсли;
					СообщитьОбОшибке(ТекстОшибки, ОбъектыРасширений);
				КонецПопытки;
			Иначе
				ТекстОшибки = СтрШаблон("Значения не заменяются в данных типа: %1", Строка(СтрокаТаблицы.Метаданные));

				СообщитьОбОшибке(ТекстОшибки, ОбъектыРасширений);
			КонецЕсли;
		КонецЦикла;

		Если Параметры.Объект <> Неопределено Тогда
			Попытка
				Если ОтключатьКонтрольЗаписи Тогда
					Параметры.Объект.ДополнительныеСвойства.Вставить("ПропуститьЗаписьВерсииОбъекта");
					ОбновлениеВерсииИБСервер.ОИБ_ЗаписатьДанные(Параметры.Объект, Ложь);
				Иначе
					Параметры.Объект.Записать();
				КонецЕсли;
			Исключение
				БылиИсключения		= Истина;
				ИнформацияОбОшибке	= ИнформацияОбОшибке();
				ТекстОшибки			= СтрШаблон("При записи объекта ""%1"" возникла ошибка:
					           |%2",
					ПолучитьНавигационнуюСсылку(Параметры.Объект.Ссылка),
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
				Если ТранзакцияАктивна() Тогда
					ВызватьИсключение ТекстОшибки;
				КонецЕсли;
				СообщитьОбОшибке(ТекстОшибки, ОбъектыРасширений);
			КонецПопытки;
		КонецЕсли;
	Исключение
		БылиИсключения = Истина;
		ВызватьИсключение;
	КонецПопытки;

	Возврат Не БылиИсключения;
КонецФункции

Процедура СообщитьОбОшибке(Знач Описание, ОбъектыРасширений)
	ЗаписьЖурналаРегистрации(
		?(ОбъектыРасширений, "Идентификаторы объектов расширений.Замена идентификатора", "Идентификаторы объектов метаданных.Замена идентификатора'"),
		УровеньЖурналаРегистрации.Ошибка,
		,
		,
		Описание,
		РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
КонецПроцедуры

Функция ПараметрыЗаменыЭлементов()
	Параметры = Новый Структура;
	Параметры.Вставить("Объект", Неопределено);

	Возврат Параметры;
КонецФункции

Функция ПолноеИмяУдаленного(ПолноеИмя)
	ПолноеИмяУдаленного	= Сред(ПолноеИмя, 3);
	ПозицияСкобки		= СтрНайти(ПолноеИмяУдаленного, "(");
	Если ПозицияСкобки > 0 Тогда
		ПолноеИмяУдаленного = Сред(ПолноеИмяУдаленного, 1, ПозицияСкобки - 1);
	КонецЕсли;

	Возврат СокрЛП(ПолноеИмяУдаленного);
КонецФункции

#КонецЕсли
