///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.События.ПриСозданииНаСервере							= Истина;
	Настройки.События.ПередЗагрузкойВариантаНаСервере				= Истина;
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик			= Истина;
	Настройки.События.ПриОпределенииПараметровВыбора				= Истина;
	Настройки.События.ПриОпределенииСвойствЭлементовФормыНастроек	= Истина;

	Настройки.РазрешеноЗагружатьСхему								= Истина;
	Настройки.РазрешеноРедактироватьСхему							= Истина;
	Настройки.РазрешеноВосстанавливатьСтандартнуюСхему				= Истина;

	Настройки.ЗагрузитьНастройкиПриИзмененииПараметров = Отчеты.УниверсальныйОтчет.ЗагрузитьНастройкиПриИзмененииПараметров();
КонецПроцедуры

Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	РазрешеноИзменятьВарианты = БазоваяПодсистемаКлиентСервер.ОН_СвойствоСтруктуры(Форма.НастройкиОтчета, "РазрешеноИзменятьВарианты", Ложь);

	Если РазрешеноИзменятьВарианты Тогда
		Форма.НастройкиОтчета.Вставить("ФормаНастроекРасширенныйРежим", 1);
	КонецЕсли;

	БазоваяПодсистемаКлиентСервер.ОН_УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ВыбратьНастройки", "Видимость", Ложь);
	БазоваяПодсистемаКлиентСервер.ОН_УстановитьСвойствоЭлементаФормы(Форма.Элементы, "СохранитьНастройки", "Видимость", Ложь);
	БазоваяПодсистемаКлиентСервер.ОН_УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ПоделитьсяНастройками", "Видимость", Ложь);
КонецПроцедуры

Процедура ПриОпределенииПараметровВыбора(Форма, СвойстваНастройки) Экспорт
	ДоступныеЗначения = БазоваяПодсистемаКлиентСервер.ОН_СвойствоСтруктуры(КомпоновщикНастроек.Настройки.ДополнительныеСвойства, "ДоступныеЗначения", Новый Структура);

	Попытка
		ЗначенияДляВыбора = БазоваяПодсистемаКлиентСервер.ОН_СвойствоСтруктуры(ДоступныеЗначения, СтрЗаменить(СвойстваНастройки.ПолеКД, "ПараметрыДанных.", ""));
	Исключение
		ЗначенияДляВыбора = Неопределено;
	КонецПопытки;

	Если ЗначенияДляВыбора <> Неопределено Тогда
		СвойстваНастройки.ОграничиватьВыборУказаннымиЗначениями	= Истина;
		СвойстваНастройки.ЗначенияДляВыбора						= ЗначенияДляВыбора;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗагрузкойВариантаНаСервере(Форма, Настройки) Экспорт
	ТекущийКлючСхемы	= Неопределено;
	Схема				= Неопределено;

	ЭтоЗагруженнаяСхема	= Ложь;

	Если ТипЗнч(Настройки) = Тип("НастройкиКомпоновкиДанных") Или Настройки = Неопределено Тогда
		Если Настройки = Неопределено Тогда
			ДополнительныеСвойстваНастроек = КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
		Иначе
			ДополнительныеСвойстваНастроек = Настройки.ДополнительныеСвойства;
		КонецЕсли;

		Если Форма.ТипФормыОтчета = ТипФормыОтчета.Основная И (Форма.РежимРасшифровки Или (Форма.КлючТекущегоВарианта <> "Main" И Форма.КлючТекущегоВарианта <> "Основной")) Тогда
			ДополнительныеСвойстваНастроек.Вставить("ОтчетИнициализирован", Истина);
		КонецЕсли;

		ДвоичныеДанныеСхемы = БазоваяПодсистемаКлиентСервер.ОН_СвойствоСтруктуры(ДополнительныеСвойстваНастроек, "СхемаКомпоновкиДанных");

		Если ТипЗнч(ДвоичныеДанныеСхемы) = Тип("ДвоичныеДанные") Тогда
			ЭтоЗагруженнаяСхема	= Истина;
			ТекущийКлючСхемы	= ХешДвоичныхДанных(ДвоичныеДанныеСхемы);
			Схема				= Отчеты.УниверсальныйОтчет.ИзвлечьСхемуИзДвоичныхДанных(ДвоичныеДанныеСхемы);
		КонецЕсли;
	КонецЕсли;

	Если ЭтоЗагруженнаяСхема Тогда
		КлючСхемы = ТекущийКлючСхемы;
		ВариантыОтчетовСервер.О_ПодключитьСхему(ЭтотОбъект, Форма, Схема, КлючСхемы);
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, Настройки, ПользовательскиеНастройки) Экспорт
	ТекущийКлючСхемы = Неопределено;

	Если Настройки = Неопределено Тогда
		Настройки = КомпоновщикНастроек.Настройки;
	КонецЕсли;

	ЭтоЗагруженнаяСхема	= Ложь;
	ДвоичныеДанныеСхемы	= БазоваяПодсистемаКлиентСервер.ОН_СвойствоСтруктуры(Настройки.ДополнительныеСвойства, "СхемаКомпоновкиДанных");

	Если ТипЗнч(ДвоичныеДанныеСхемы) = Тип("ДвоичныеДанные") Тогда
		ТекущийКлючСхемы = ХешДвоичныхДанных(ДвоичныеДанныеСхемы);
		Если ТекущийКлючСхемы <> КлючСхемы Тогда
			Схема				= Отчеты.УниверсальныйОтчет.ИзвлечьСхемуИзДвоичныхДанных(ДвоичныеДанныеСхемы);
			ЭтоЗагруженнаяСхема	= Истина;
		КонецЕсли;
	КонецЕсли;

	ДоступныеЗначения		= Неопределено;
	ФиксированныеПараметры	= Отчеты.УниверсальныйОтчет.ФиксированныеПараметры(Настройки, ПользовательскиеНастройки, ДоступныеЗначения);

	Если ТекущийКлючСхемы = Неопределено Тогда
		ТекущийКлючСхемы = ФиксированныеПараметры.ТипОбъектаМетаданных + "/" + ФиксированныеПараметры.ИмяОбъектаМетаданных + "/" + ФиксированныеПараметры.ИмяТаблицы;
		ТекущийКлючСхемы = БазоваяПодсистемаСервер.ОН_СократитьСтрокуКонтрольнойСуммой(ТекущийКлючСхемы, 100);

		Если ТекущийКлючСхемы <> КлючСхемы Тогда
			КлючСхемы	= "";
			Схема		= Отчеты.УниверсальныйОтчет.СхемаКомпоновкиДанных(ФиксированныеПараметры);
		КонецЕсли;
	КонецЕсли;

	Если ТекущийКлючСхемы <> Неопределено И ТекущийКлючСхемы <> КлючСхемы Тогда
		КлючСхемы = ТекущийКлючСхемы;
		ВариантыОтчетовСервер.О_ПодключитьСхему(ЭтотОбъект, Контекст, Схема, КлючСхемы);

		Если ЭтоЗагруженнаяСхема Тогда
			Отчеты.УниверсальныйОтчет.УстановитьСтандартныеНастройкиЗагруженнойСхемы(ЭтотОбъект, ДвоичныеДанныеСхемы, Настройки, ПользовательскиеНастройки);
		Иначе
			Отчеты.УниверсальныйОтчет.УстановитьСтандартныеНастройки(ЭтотОбъект, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки);
		КонецЕсли;

		Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") Тогда
			// Переопределение.
			ИнтеграцияПодсистемСервер.ПередЗагрузкойВариантаНаСервере(Контекст, Настройки);
			ПередЗагрузкойВариантаНаСервере(Контекст, Настройки);

			ИспользуемыеТаблицы = ВариантыОтчетовСервер.ВО_ИспользуемыеТаблицы(СхемаКомпоновкиДанных);
			ИспользуемыеТаблицы.Добавить(Метаданные().ПолноеИмя());
			Контекст.НастройкиОтчета.Вставить("ИспользуемыеТаблицы", ИспользуемыеТаблицы);
		ИначеЕсли ТипЗнч(Контекст) = Тип("Структура") Тогда
			АдресСхемы = БазоваяПодсистемаКлиентСервер.ОН_СвойствоСтруктуры(Контекст, "АдресСхемы");
			Если Не ЭтоАдресВременногоХранилища(АдресСхемы) Тогда
				Контекст.Вставить("АдресСхемы", ПоместитьВоВременноеХранилище(Схема, Новый УникальныйИдентификатор));
			КонецЕсли;
		КонецЕсли;
	Иначе
		Отчеты.УниверсальныйОтчет.УстановитьФиксированныеПараметры(ЭтотОбъект, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки);
	КонецЕсли;

	КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ДоступныеЗначения", ДоступныеЗначения);

	Отчеты.УниверсальныйОтчет.УстановитьСтандартныйЗаголовокОтчета(Контекст, Настройки, ФиксированныеПараметры, ДоступныеЗначения);
КонецПроцедуры

Процедура ПриОпределенииСвойствЭлементовФормыНастроек(ТипФормы, СвойстваЭлементов, ПользовательскиеНастройки) Экспорт
	Если ТипФормы <> ТипФормыОтчета.Основная Тогда
		Возврат;
	КонецЕсли;

	СвойстваГруппы				= ВариантыОтчетовСервер.О_СвойстваГруппыЭлементовФормы();
	СвойстваГруппы.Группировка	= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	СвойстваЭлементов.Группы.Вставить("ФиксированныеПараметры", СвойстваГруппы);

	ФиксированныеПараметры	= Новый Структура("Период, ТипОбъектаМетаданных, ИмяОбъектаМетаданных, ИмяТаблицы");
	ШиринаПоля				= Новый Структура("ТипОбъектаМетаданных, ИмяОбъектаМетаданных, ИмяТаблицы", 20, 35, 20);

	Для Каждого ЭлементНастройки Из ПользовательскиеНастройки Цикл
		Если ТипЗнч(ЭлементНастройки) <> Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Или Не ФиксированныеПараметры.Свойство(ЭлементНастройки.Параметр) Тогда
			Продолжить;
		КонецЕсли;

		СвойстваПоля = СвойстваЭлементов.Поля.Найти(ЭлементНастройки.ИдентификаторПользовательскойНастройки, "ИдентификаторНастройки");

		Если СвойстваПоля = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		СвойстваПоля.ИдентификаторГруппы = "ФиксированныеПараметры";

		ИмяПараметра = Строка(ЭлементНастройки.Параметр);
		Если ИмяПараметра <> "Период" Тогда
			СвойстваПоля.ПоложениеЗаголовка			= ПоложениеЗаголовкаЭлементаФормы.Нет;
			СвойстваПоля.Ширина						= ШиринаПоля[ИмяПараметра];
			СвойстваПоля.РастягиватьПоГоризонтали	= Ложь;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();

	Отчеты.УниверсальныйОтчет.ВывестиКоличествоПодчиненныхЗаписей(Настройки, СхемаКомпоновкиДанных, СтандартнаяОбработка);

	Если СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;

	КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки 	= КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);

	ПроцессорКомпоновки	= Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,, ДанныеРасшифровки);

	ПроцессорВывода		= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
КонецПроцедуры

Функция ХешДвоичныхДанных(ДвоичныеДанные)
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
	ХешированиеДанных.Добавить(ДвоичныеДанные);

	Возврат СтрЗаменить(ХешированиеДанных.ХешСумма, " ", "") + "_" + Формат(ДвоичныеДанные.Размер(), "ЧГ=");
КонецФункции

#Иначе
ВызватьИсключение "Недопустимый вызов объекта на клиенте.";
#КонецЕсли
