///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбновлениеИнформационнойБазы

Функция сОИБ_НеобходимоОбновлениеИнформационнойБазы() Экспорт
	Если НЕ ПустаяСтрока(Метаданные.Версия) И ОбновлениеВерсииИБСервер.сОИБ_ВерсияИБ(Метаданные.Имя) <> Метаданные.Версия
			Тогда
		Возврат Истина;
	КонецЕсли;

	Если Не ОбновлениеВерсииИБСервер.сОИБ_ВыполненаРегистрацияОтложенныхОбработчиковОбновления() Тогда
		Возврат Истина;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	Запустить = ПараметрыСеанса.ПараметрыКлиентаНаСервере.Получить("ЗапуститьОбновлениеИнформационнойБазы");
	УстановитьПривилегированныйРежим(Ложь);

	Если Запустить <> Неопределено И ПользователиСервер.П_ЭтоПолноправныйПользователь(, Истина, Истина) Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
КонецФункции

#КонецОбласти
