///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбновлениеИнформационнойБазы

Функция сОИБ_НеобходимоОбновлениеИнформационнойБазы() Экспорт
	Если НЕ ПустаяСтрока(Метаданные.Версия) И ОбновлениеВерсииИБСервер.сОИБ_ВерсияИБ(Метаданные.Имя) <> Метаданные.Версия
			Тогда
		Возврат Истина;
	КонецЕсли;

	Если Не ОбновлениеВерсииИБСервер.сОИБ_ВыполненаРегистрацияОтложенныхОбработчиковОбновления() Тогда
		Возврат Истина;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	Запустить = ПараметрыСеанса.ПараметрыКлиентаНаСервере.Получить("ЗапуститьОбновлениеИнформационнойБазы");
	УстановитьПривилегированныйРежим(Ложь);

	Если Запустить <> Неопределено И ПользователиСервер.П_ЭтоПолноправныйПользователь(, Истина, Истина) Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
КонецФункции

Функция сОИБ_ОчередьОтложенногоОбработчикаОбновления() Экспорт
	Обработчики        = ОбновлениеВерсииИБСервер.ОИБ_НоваяТаблицаОбработчиковОбновления();
	ОписанияПодсистем  = БазоваяПодсистемаСерверПовтИсп.СП_ОписанияПодсистем();
	Для Каждого ИмяПодсистемы Из ОписанияПодсистем.Порядок Цикл
		ОписаниеПодсистемы = ОписанияПодсистем.ПоИменам.Получить(ИмяПодсистемы);
		Если ОписаниеПодсистемы.РежимВыполненияОтложенныхОбработчиков <> "Параллельно" Тогда
			Продолжить;
		КонецЕсли;

		Модуль = БазоваяПодсистемаСервер.ОН_ОбщийМодуль(ОписаниеПодсистемы.ОсновнойСерверныйМодуль);
		Модуль.ПриДобавленииОбработчиковОбновления(Обработчики);
	КонецЦикла;

	Отбор					= Новый Структура;
	Отбор.Вставить("РежимВыполнения", "Отложенно");
	ОтложенныеОбработчики	= Обработчики.НайтиСтроки(Отбор);

	ОчередьПоИмени          = Новый Соответствие;
	ОчередьПоИдентификатору = Новый Соответствие;
	Для Каждого ОтложенныйОбработчик Из ОтложенныеОбработчики Цикл
		Если ОтложенныйОбработчик.ОчередьОтложеннойОбработки = 0 Тогда
			Продолжить;
		КонецЕсли;

		ОчередьПоИмени.Вставить(ОтложенныйОбработчик.Процедура, ОтложенныйОбработчик.ОчередьОтложеннойОбработки);
		Если ЗначениеЗаполнено(ОтложенныйОбработчик.Идентификатор) Тогда
			ОчередьПоИдентификатору.Вставить(ОтложенныйОбработчик.Идентификатор, ОтложенныйОбработчик.ОчередьОтложеннойОбработки);
		КонецЕсли;
	КонецЦикла;

	Результат = Новый Соответствие;
	Результат.Вставить("ПоИмени",			ОчередьПоИмени);
	Результат.Вставить("ПоИдентификатору",	ОчередьПоИдентификатору);

	Возврат Новый ФиксированноеСоответствие(Результат);
КонецФункции

Функция сОИБ_КешПроверкиЗарегистрированныхОбъектов() Экспорт
	Возврат Новый Соответствие;
КонецФункции

#КонецОбласти
