
Перем ПараметрыПриложения Экспорт;

Процедура ПередНачаломРаботыСистемы()
	БазоваяПодсистемаКлиент.ПередНачаломРаботыСистемы();
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	БазоваяПодсистемаКлиент.СП_ПриНачалеРаботыСистемы();
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	БазоваяПодсистемаКлиент.СП_ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения);
КонецПроцедуры

Процедура ОбработкаПолученияФормыВыбораПользователейСистемыВзаимодействия(НазначениеВыбора, Форма, ИдентификаторОбсуждения, Параметры, ВыбраннаяФорма, СтандартнаяОбработка)
	// Зарезервировано для новых подсистем
КонецПроцедуры
