///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

Процедура ПередНачаломРаботыСистемы(Параметры) Экспорт
	// Зарезервировано для новых подсистем

	// Проверка минимально допустимой версии платформы для запуска.
	Параметры.Модули.Добавить(Новый Структура("Модуль, Номер", БазоваяПодсистемаКлиент, 2));

	// Проверка необходимости восстановления связи с главным узлом.
	Параметры.Модули.Добавить(Новый Структура("Модуль, Номер", БазоваяПодсистемаКлиент, 3));

	// Проверка необходимости выбора начальных неизменяемых настроек ИБ (основной язык, часовой пояс).
	Параметры.Модули.Добавить(Новый Структура("Модуль, Номер", БазоваяПодсистемаКлиент, 4));

	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы(Параметры) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПослеНачалаРаботыСистемы() Экспорт
	БазоваяПодсистемаКлиент.СП_ПослеНачалаРаботыСистемы();

	// Зарезервировано для новых подсистем

КонецПроцедуры
