///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОпределитьПоведениеВМобильномКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;

	ОбщиеНастройки = ПередЗакрытиемНаСервере(ОтключитьОписания);
	Оповестить("СтандартныеПодсистемы.ВариантыОтчетов.ИзменениеОбщихНастроек", ОбщиеНастройки, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьСейчас(Команда)
	ОтключитьОписания = Истина;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОпределитьПоведениеВМобильномКлиенте()
	ЭтоМобильныйКлиент = БазоваяПодсистемаСервер.ОН_ЭтоМобильныйКлиент();
	Если Не ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;

	ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Авто;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПередЗакрытиемНаСервере(ОтключитьОписания)
	ОбщиеНастройки = ВариантыОтчетовСервер.ВО_ОбщиеНастройкиПанели();
	Если ОтключитьОписания Тогда
		ОбщиеНастройки.ПоказыватьПодсказки = Ложь;
	КонецЕсли;
	ОбщиеНастройки.ПоказатьОповещениеОПодсказках = Ложь;
	ВариантыОтчетовСервер.ВО_СохранитьОбщиеНастройкиПанели(ОбщиеНастройки);

	Возврат ОбщиеНастройки;
КонецФункции
