///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбновлениеИнформационнойБазы

Функция сОИБ_ВыполнитьОбновлениеИнформационнойБазы(ПриЗапускеКлиентскогоПриложения = Ложь, Перезапустить = Ложь, ВыполнятьОтложенныеОбработчики = Ложь) Экспорт
	ПараметрыОбновления									= ОбновлениеВерсииИБСервер.сОИБ_ПараметрыОбновления();
	ПараметрыОбновления.ПриЗапускеКлиентскогоПриложения	= ПриЗапускеКлиентскогоПриложения;
	ПараметрыОбновления.Перезапустить					= Перезапустить;
	ПараметрыОбновления.ВыполнятьОтложенныеОбработчики	= ВыполнятьОтложенныеОбработчики;

	Попытка
		Результат = ОбновлениеВерсииИБСервер.сОИБ_ВыполнитьОбновлениеИнформационнойБазы(ПараметрыОбновления);
	Исключение
		// Переход в режим открытия формы повторной синхронизации данных перед запуском
		// с двумя вариантами "Синхронизировать и продолжить" и "Продолжить".

		// Зарезервировано для новых подсистем

		ВызватьИсключение;
	КонецПопытки;

	Перезапустить = ПараметрыОбновления.Перезапустить;

	Возврат Результат;
КонецФункции

Процедура сОИБ_СнятьБлокировкуФайловойБазы() Экспорт
	Если Не БазоваяПодсистемаСервер.ОН_ИнформационнаяБазаФайловая() Тогда
		Возврат;
	КонецЕсли;

	// Зарезервировано для новых подсистем
КонецПроцедуры

#КонецОбласти
