///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбновлениеИнформационнойБазы

Функция сОИБ_ВыполнитьОбновлениеИнформационнойБазы(ПриЗапускеКлиентскогоПриложения = Ложь, Перезапустить = Ложь, ВыполнятьОтложенныеОбработчики = Ложь) Экспорт
	ПараметрыОбновления									= ОбновлениеВерсииИБСервер.сОИБ_ПараметрыОбновления();
	ПараметрыОбновления.ПриЗапускеКлиентскогоПриложения	= ПриЗапускеКлиентскогоПриложения;
	ПараметрыОбновления.Перезапустить					= Перезапустить;
	ПараметрыОбновления.ВыполнятьОтложенныеОбработчики	= ВыполнятьОтложенныеОбработчики;

	Попытка
		Результат = ОбновлениеВерсииИБСервер.сОИБ_ВыполнитьОбновлениеИнформационнойБазы(ПараметрыОбновления);
	Исключение
		// Переход в режим открытия формы повторной синхронизации данных перед запуском
		// с двумя вариантами "Синхронизировать и продолжить" и "Продолжить".

		// Зарезервировано для новых подсистем

		ВызватьИсключение;
	КонецПопытки;

	Перезапустить = ПараметрыОбновления.Перезапустить;

	Возврат Результат;
КонецФункции

Процедура сОИБ_СнятьБлокировкуФайловойБазы() Экспорт
	Если Не БазоваяПодсистемаСервер.ОН_ИнформационнаяБазаФайловая() Тогда
		Возврат;
	КонецЕсли;

	// Зарезервировано для новых подсистем
КонецПроцедуры

Функция сОИБ_ДанныеРасшифровкиОтчета(ДанныеРасшифровки, ИндексРасшифровки, Кеш = Неопределено, КешПриоритетов = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(ДанныеРасшифровки) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	Если ИндексРасшифровки = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Расшифровка = Данные.Элементы[ИндексРасшифровки].ПолучитьПоля();
	Если Расшифровка.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	СведенияОбОбновлении	= ОбновлениеВерсииИБСервер.сОИБ_СведенияОбОбновленииИнформационнойБазы();
	НачалоОбновления		= СведенияОбОбновлении.ВремяНачалаОтложенногоОбновления;

	ЗначениеРасшифровки	= Расшифровка.Получить(0);
	Результат			= Новый Структура;
	Результат.Вставить("ИмяПоля",			ЗначениеРасшифровки.Поле);
	Результат.Вставить("Значение",			ЗначениеРасшифровки.Значение);
	Результат.Вставить("НачалоОбновления",	НачалоОбновления);
	Результат.Вставить("Кеш",				Кеш);
	Результат.Вставить("КешПриоритетов",	КешПриоритетов);

	Возврат Результат;
КонецФункции

#КонецОбласти
