///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидКонтактнойИнформации = Параметры.ВидКонтактнойИнформации;
	Если Не ЗначениеЗаполнено(ВидКонтактнойИнформации) Тогда
		ВызватьИсключение "Команда не может быть выполнена для указанного объекта из-за некорректного внедрения контактной информации.";
	КонецЕсли;
	ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.ВебСтраница;

	Заголовок = ?(Не Параметры.Свойство("Заголовок") Или ПустаяСтрока(Параметры.Заголовок), Строка(ВидКонтактнойИнформации), Параметры.Заголовок);

	ЗначенияПолей = ОпределитьЗначениеАдреса(Параметры);

	Если ПустаяСтрока(ЗначенияПолей) Тогда
		Данные = КонтактнаяИнформацияКлиентСервер.РСА_ОписаниеНовойКонтактнойИнформации(ТипКонтактнойИнформации);
	ИначеЕсли ТипЗнч(ЗначенияПолей) = Тип("Строка") И СтрНачинаетсяС(СокрЛ(ЗначенияПолей), "{") Тогда
		Данные = КонтактнаяИнформацияСервер.сУКИ_JSONВКонтактнуюИнформациюПоПолям(ЗначенияПолей, Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
	Иначе
		Если ТипЗнч(ЗначенияПолей) = Тип("Строка") И СтрНачинаетсяС(СокрЛ(ЗначенияПолей), "<") Тогда
			РезультатыЧтения		= Новый Структура;
			КонтактнаяИнформация	= КонтактнаяИнформацияСервер.сУКИ_КонтактнаяИнформацияИзXML(ЗначенияПолей, ТипКонтактнойИнформации, РезультатыЧтения);
			Если РезультатыЧтения.Свойство("ТекстОшибки") Тогда
				// Распознали с ошибками, сообщим при открытии.
				КонтактнаяИнформация.Представление = Параметры.Представление;
			КонецЕсли;

			Данные			= КонтактнаяИнформацияСервер.сУКИ_КонтактнаяИнформацияВСтруктуруJSON(КонтактнаяИнформация, ТипКонтактнойИнформации);
		Иначе
			Данные			= КонтактнаяИнформацияКлиентСервер.РСА_ОписаниеНовойКонтактнойИнформации(ТипКонтактнойИнформации);
			Данные.value	= ЗначенияПолей;
			Данные.Comment	= Параметры.Комментарий;
		КонецЕсли;
	КонецЕсли;

	Адрес        = Данные.Value;
	Наименование = СокрЛП(Параметры.Представление);
	Комментарий  = Данные.Comment;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Закрыть(РезультатВыбора(Адрес, Наименование, Комментарий));
КонецПроцедуры

&НаСервере
Функция ОпределитьЗначениеАдреса(Параметры)
	ЗначенияПолей = "";
	Если Параметры.Свойство("Значение") Тогда
		Если ПустаяСтрока(Параметры.Значение) Тогда
			Если Параметры.Свойство("ЗначенияПолей") Тогда
				ЗначенияПолей = Параметры.ЗначенияПолей;
			КонецЕсли;
		Иначе
			ЗначенияПолей = Параметры.Значение;
		КонецЕсли;
	Иначе
		ЗначенияПолей = Параметры.ЗначенияПолей;
	КонецЕсли;

	Возврат ЗначенияПолей;
КонецФункции

&НаСервереБезКонтекста
Функция РезультатВыбора(Адрес, Наименование, Комментарий)
	ТипКонтактнойИнформации	= Перечисления.ТипыКонтактнойИнформации.ВебСтраница;
	НаименованиеСайта		= ?(ЗначениеЗаполнено(Наименование), Наименование, Адрес);

	КонтактнаяИнформация         = КонтактнаяИнформацияКлиентСервер.УКИ_ОписаниеНовойКонтактнойИнформации(ТипКонтактнойИнформации );
	КонтактнаяИнформация.value   = СокрЛП(Адрес);
	КонтактнаяИнформация.name    = СокрЛП(НаименованиеСайта);
	КонтактнаяИнформация.comment = СокрЛП(Комментарий);

	ДанныеВыбора = КонтактнаяИнформацияСервер.сУКИ_СтруктураВСтрокуJSON(КонтактнаяИнформация);

	Результат = Новый Структура;
	Результат.Вставить("Тип",                  ТипКонтактнойИнформации);
	Результат.Вставить("Адрес",                Адрес);
	Результат.Вставить("КонтактнаяИнформация", КонтактнаяИнформацияСервер.УКИ_КонтактнаяИнформацияВXML(ДанныеВыбора, Наименование, ТипКонтактнойИнформации));
	Результат.Вставить("Значение",             ДанныеВыбора);
	Результат.Вставить("Представление",        НаименованиеСайта);
	Результат.Вставить("Комментарий",          КонтактнаяИнформация.Comment);

	Возврат Результат
КонецФункции
