///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПоказатьНастройкиВнешнихПользователей = Параметры.ПоказатьНастройкиВнешнихПользователей;

	ПредлагаемыеЗначенияНастроек = Новый Структура;
	ПредлагаемыеЗначенияНастроек.Вставить("МинимальнаяДлинаПароля", 8);
	ПредлагаемыеЗначенияНастроек.Вставить("МаксимальныйСрокДействияПароля", 30);
	ПредлагаемыеЗначенияНастроек.Вставить("МинимальныйСрокДействияПароля", 1);
	ПредлагаемыеЗначенияНастроек.Вставить("ЗапретитьПовторениеПароляСредиПоследних", 10);
	ПредлагаемыеЗначенияНастроек.Вставить("ПросрочкаРаботыВПрограммеДоЗапрещенияВхода", 45);

	Если ПоказатьНастройкиВнешнихПользователей Тогда
		БазоваяПодсистемаСервер.СП_УстановитьКлючНазначенияФормы(ЭтотОбъект, "ВнешниеПользователи");
		АвтоЗаголовок	= Ложь;
		Заголовок		= "Настройки входа внешних пользователей";
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПользователиСервер.сП_НастройкиВхода().ВнешниеПользователи);
	Иначе
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПользователиСервер.сП_НастройкиВхода().Пользователи);
	КонецЕсли;

	Для Каждого КлючИЗначение Из ПредлагаемыеЗначенияНастроек Цикл
		Если ЗначениеЗаполнено(ЭтотОбъект[КлючИЗначение.Ключ]) Тогда
			ЭтотОбъект[КлючИЗначение.Ключ + "Включить"]	= Истина;
		Иначе
			ЭтотОбъект[КлючИЗначение.Ключ]				= КлючИЗначение.Значение;
			Элементы[КлючИЗначение.Ключ].Доступность	= Ложь;
		КонецЕсли;
	КонецЦикла;
	ВидимостьГруппыВосстановлениеПароля = Ложь;

	НастройкиВосстановленияПароля = ПользователиСервер.сП_НастройкиВосстановленияПароля();
	Если НастройкиВосстановленияПароля <> Неопределено Тогда
		ВидимостьГруппыВосстановлениеПароля = НастройкиВосстановленияПароля.СпособВосстановленияПароля = ПользователиСервер.сП_СпособВосстановленияПароляПользователяИнформационнойБазы("ОтправкаКодаПодтвержденияПоЗаданнымПараметрам") Или НастройкиВосстановленияПароля.СпособВосстановленияПароля = ПользователиСервер.сП_СпособВосстановленияПароляПользователяИнформационнойБазы("ОтправкаКодаПодтвержденияЧерезСтандартныйСервис");
	КонецЕсли;

	Элементы.ПредупреждениеВосстановлениеПароля.Видимость = ВидимостьГруппыВосстановлениеПароля;
КонецПроцедуры

&НаКлиенте
Процедура ПарольДолженОтвечатьТребованиямСложностиПриИзменении(Элемент)
	Если МинимальнаяДлинаПароля < 7 Тогда
		МинимальнаяДлинаПароля = 7;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МинимальнаяДлинаПароляПриИзменении(Элемент)
	Если МинимальнаяДлинаПароля < 7  И ПарольДолженОтвечатьТребованиямСложности Тогда
		МинимальнаяДлинаПароля = 7;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаВключитьПриИзменении(Элемент)
	ИмяНастройки = Лев(Элемент.Имя, СтрДлина(Элемент.Имя) - СтрДлина("Включить"));

	Если ЭтотОбъект[Элемент.Имя] = Ложь Тогда
		ЭтотОбъект[ИмяНастройки] = ПредлагаемыеЗначенияНастроек[ИмяНастройки];
	КонецЕсли;

	Элементы[ИмяНастройки].Доступность = ЭтотОбъект[Элемент.Имя];
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьНаСервере();
	Оповестить("Запись_НаборКонстант", Новый Структура, "НастройкиВходаПользователей");
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	Настройки											= ПользователиСервер.П_НовоеОписаниеНастроекВхода();
	Настройки.ПарольДолженОтвечатьТребованиямСложности	= ПарольДолженОтвечатьТребованиямСложности;

	Для Каждого КлючИЗначение Из ПредлагаемыеЗначенияНастроек Цикл
		Если ЭтотОбъект[КлючИЗначение.Ключ + "Включить"] Тогда
			Настройки[КлючИЗначение.Ключ] = ЭтотОбъект[КлючИЗначение.Ключ];
		Иначе
			Настройки[КлючИЗначение.Ключ] = 0;
		КонецЕсли;
	КонецЦикла;

	ПользователиСервер.П_УстановитьНастройкиВхода(Настройки, ПоказатьНастройкиВнешнихПользователей);

	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры
