///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

Процедура СП_ОбработчикОжиданияПриНачалеРаботыСистемы() Экспорт
	БазоваяПодсистемаКлиент.СП_ПриНачалеРаботыСистемы(, Ложь);
КонецПроцедуры

Процедура СП_ОбработчикОжиданияИнтерактивнаяОбработкаПередЗавершениемРаботыСистемы() Экспорт
	БазоваяПодсистемаКлиент.СП_НачатьИнтерактивнуюОбработкуПередЗавершениемРаботыСистемы();
КонецПроцедуры

Процедура СП_ПоказатьРекомендациюПоОбъемуОперативнойПамяти() Экспорт
	БазоваяПодсистемаКлиент.СП_ОповеститьОНехваткеПамяти();
КонецПроцедуры

Процедура СП_ОбработчикОжиданияСтандартныхПериодическихПроверок() Экспорт
	БазоваяПодсистемаКлиент.СП_ПриВыполненииСтандартныхПериодическихПроверок();
КонецПроцедуры

Процедура СП_ПоказатьПредупрежденияПриЗавершенииРаботы() Экспорт
	Предупреждения	= БазоваяПодсистемаКлиент.СП_ПараметрКлиента("ПредупрежденияПриЗавершенииРаботы");
	Пояснение		= "и выполнить дополнительные действия";
	Если Предупреждения.Количество() = 1 И Не ПустаяСтрока(Предупреждения[0].ТекстГиперссылки) Тогда
		Пояснение = Предупреждения[0].ТекстГиперссылки;
	КонецЕсли;
	ПоказатьОповещениеПользователя("Нажмите, чтобы завершить работу",
		"e1cib/command/ОбщаяКоманда.ПредупрежденияПриЗавершенииРаботы",
		Пояснение, БиблиотекаКартинок.ЗавершитьРаботу, СтатусОповещенияПользователя.Важное);
КонецПроцедуры
