///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

Процедура ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры) Экспорт
	ВариантыОтчетовСервер.ВО_ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры);

	// Зарезервировано для новых подсистем

	ОбновлениеВерсииИБСервер.сОИБ_ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры);

		// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриДобавленииПараметровРаботыКлиента(Параметры) Экспорт
	// Зарезервировано для новых подсистем

	ПользователиСервер.сП_ПриДобавленииПараметровРаботыКлиента(Параметры);

	// Зарезервировано для новых подсистем

	БазоваяПодсистемаСервер.СП_ДобавитьПараметрыРаботыКлиента(Параметры);

	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПередЗапускомПрограммы() Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт
	ОбновлениеВерсииИБСервер.сОИБ_ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики);
	ПользователиСервер.сП_ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики);

	// Зарезервировано для новых подсистем

	КонтактнаяИнформацияСервер.сУКИ_ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики);

	// Зарезервировано для новых подсистем

	РегламентныеЗаданияСервер.БРСВР_ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики);

	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриУстановкеПараметровСеанса(Параметры) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриОпределенииОбъектовСНачальнымЗаполнением(Объекты) Экспорт
	// Зарезервировано для новых подсистем

	ПользователиСервер.сП_ПриОпределенииОбъектовСНачальнымЗаполнением(Объекты);
	КонтактнаяИнформацияСервер.сУКИ_ПриОпределенииОбъектовСНачальнымЗаполнением(Объекты);

	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриДобавленииПодсистем(МодулиПодсистем) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриОпределенииНазначенияРолей(НазначениеРолей) Экспорт
	// Зарезервировано для новых подсистем

	БазоваяПодсистемаСервер.СП_ПриОпределенииНазначенияРолей(НазначениеРолей);

	// Зарезервировано для новых подсистем

	ВариантыОтчетовСервер.ВО_ПриОпределенииНазначенияРолей(НазначениеРолей);

	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПослеЗаписиАдминистратораПриАвторизации(Комментарий) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриСозданииАдминистратора(Администратор, Уточнение) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПослеУстановкиПользователяИБ(Ссылка, ПарольПользователяСервиса) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриОпределенииНастроек(Настройки) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриПолученииПрочихНастроек(СведенияОПользователе, Настройки) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриСохраненииПрочихНастроек(СведенияОПользователе, Настройки) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПослеОбновленияСоставовГруппПользователей(УчастникиИзменений, ИзмененныеГруппы) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПослеИзмененияОбъектаАвторизацииВнешнегоПользователя(ВнешнийПользователь, СтарыйОбъектАвторизации, НовыйОбъектАвторизации) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПослеДобавленияИзмененияПользователяИлиГруппы(Ссылка, ЭтоНовый) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриОпределенииТекстаВопросаПередЗаписьюПервогоАдминистратора(ТекстВопроса) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриОпределенииДействийВФорме(Ссылка, ДействияВФорме) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриДобавленииПереименованийОбъектовМетаданных(Итог) Экспорт
	БазоваяПодсистемаСервер.СП_ПриДобавленииПереименованийОбъектовМетаданных(Итог);

	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриЗаполненииВсехПараметровРаботыРасширений() Экспорт
	// Зарезервировано для новых подсистем

	ВариантыОтчетовСервер.ВО_ПриЗаполненииВсехПараметровРаботыРасширений();
КонецПроцедуры

Процедура ПриОчисткеВсехПараметровРаботыРасширений() Экспорт
	ВариантыОтчетовСервер.ВО_ПриОчисткеВсехПараметровРаботыРасширений();
КонецПроцедуры

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	// Зарезервировано для новых подсистем

	ВариантыОтчетовСервер.ВО_ПриДобавленииОбработчиковОбновления(Обработчики);

	// Зарезервировано для новых подсистем

	КонтактнаяИнформацияСервер.сУКИ_ПриДобавленииОбработчиковОбновления(Обработчики);

	// Зарезервировано для новых подсистем

	ОбновлениеВерсииИБСервер.сОИБ_ПриДобавленииОбработчиковОбновления(Обработчики);

	// Зарезервировано для новых подсистем

	ПользователиСервер.сП_ПриДобавленииОбработчиковОбновления(Обработчики);

	// Зарезервировано для новых подсистем

	РегламентныеЗаданияСервер.сРЗ_ПриДобавленииОбработчиковОбновления(Обработчики);

	// Зарезервировано для новых подсистем

	БазоваяПодсистемаСервер.СП_ПриДобавленииОбработчиковОбновления(Обработчики);

	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия, Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриНастройкеВариантовОтчетов(Настройки) Экспорт
	// Зарезервировано для новых подсистем

	ОбновлениеВерсииИБСервер.сОИБ_ПриНастройкеВариантовОтчетов(Настройки);

	// Зарезервировано для новых подсистем

	ПользователиСервер.сП_ПриНастройкеВариантовОтчетов(Настройки);

	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриИзмененииКлючейВариантовОтчетов(Изменения) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриОпределенииНастроекВариантовОтчетов(Настройки) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриОпределенииРазделовСВариантамиОтчетов(СписокРазделов) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриСозданииНаСервереВариантыОтчетов(Форма, Отказ, СтандартнаяОбработка) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПередЗагрузкойВариантаНаСервере(Форма, НовыеНастройкиКД) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриОпределенииПараметровВыбораВариантыОтчетов(Форма, СвойстваНастройки) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриЗапретеРаботыСВнешнимиРесурсами() Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриРазрешенииРаботыСВнешнимиРесурсами() Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриОпределенииСправочниковДляЗагрузкиДанных(ЗагружаемыеСправочники) Экспорт
	БазоваяПодсистемаСервер.СП_ПриОпределенииСправочниковДляЗагрузкиДанных(ЗагружаемыеСправочники);
	ПользователиСервер.сП_ПриОпределенииСправочниковДляЗагрузкиДанных(ЗагружаемыеСправочники);
	КонтактнаяИнформацияСервер.сУКИ_ПриОпределенииСправочниковДляЗагрузкиДанных(ЗагружаемыеСправочники);

	// Зарезервировано для новых подсистем

	ВариантыОтчетовСервер.ВО_ПриОпределенииСправочниковДляЗагрузкиДанных(ЗагружаемыеСправочники);

	// Зарезервировано для новых подсистем
КонецПроцедуры
