///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

Процедура ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриДобавленииПараметровРаботыКлиента(Параметры) Экспорт
	// Зарезервировано для новых подсистем

	БазоваяПодсистемаСервер.СП_ДобавитьПараметрыРаботыКлиента(Параметры);

	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПередЗапускомПрограммы() Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриУстановкеПараметровСеанса(Параметры) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриОпределенииОбъектовСНачальнымЗаполнением(Объекты) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриДобавленииПодсистем(МодулиПодсистем) Экспорт
	// Зарезервировано для новых подсистем
КонецПроцедуры
